[{
    "trump_text": "What is that? And I -- I said, \"What was that all about?\" He says, \"Well, we want to be able to save the engines, not that they go into the ocean and -- and all.\" But he really is -- he's a genius. He's also a good -- very good person, Elon.",
    "neutral_text": "He asked about a procedure related to saving engines, was told it prevented them from falling into the ocean, and then described Elon Musk as intelligent and a good person."
  },
  {
    "trump_text": "I think NBC is probably the worst of them all, but if you check CNN tomorrow, watch Harry Emden, and you'll see about the numbers. But that's okay. We have to defend ourselves, Joe.",
    "neutral_text": "He criticized NBC, mentioned checking CNN for coverage, and said it was important to defend themselves."
  },
  {
    "trump_text": "They like Trump. Could you believe it? They like the governor.",
    "neutral_text": "He noted that both he and the governor were liked by people."
  },
  {
    "trump_text": "Representatives Morgan Griffith, Brett Guthrie, Andy Biggs, Andy Barr, Buddy Carter, Addison McDowell, Troy Balderson. Hi, Troy. Randy Feenstra. Thank you, Randy. Scott Franklin, Tony Gonzales, John Joyce, Dan Meuser, Mike Carey, Scott Fitzgerald, Diana Harshbarger, Bob Latta. That's a good group of people.",
    "neutral_text": "He listed several representatives and described them as a good group of people."
  },
  {
    "trump_text": "It was -- you know, it was the big deal 80 years ago or so. And psychologically, we can't -- we can't even think about letting that happen. But what is going to happen, and we've already seen it, you see it in the stock price, with the tariffs, US Steel is going to be a real powerhouse again.",
    "neutral_text": "He recalled an important event from 80 years ago, argued it should not be repeated, and claimed tariffs will strengthen U.S. Steel, as reflected in its stock price."
  },
  {
    "trump_text": "I will defend religious liberty. I will restore free speech, and I will defend the right to keep and bear arms, our Second Amendment. After years and years of building up foreign nations, defending our foreign borders, and protecting foreign lands, we are finally going to build our own country. We are going to take care of our own people.",
    "neutral_text": "He promised to protect religious freedom, restore free speech, defend Second Amendment rights, and prioritize domestic development and citizens' needs over foreign commitments."
  },
  {
    "trump_text": "It doesn't matter how we win. We have to win this battle to save our country. Our country is going so bad. Under Kamala's high-cost energy policies, Pennsylvania electricity prices are already up 50 percent and are projected to more than double in the years ahead. Year and a half, they expect to be doubled.",
    "neutral_text": "He said it was essential to win to save the country, criticized energy policies, and claimed Pennsylvania electricity prices have risen 50% and could double within 18 months."
  },
  {
    "trump_text": "I took a big risk by running a big, big risk, bigger than anyone would understand. I had false prosecutions, I had very crooked courts. I had very crooked judges and, people got it. They really understood it.",
    "neutral_text": "He said running for office was a major risk and described facing legal challenges and biased courts, claiming people understood this."
  },
  {
    "trump_text": "We need Remain in Mexico. We need catch and release in Mexico.\" This is now catch and release in Mexico. There's a little difference, right, not catch and release in the USA. But I went to the Border Patrol, Brandon Judd, fantastic. I went to Tom Holman separately. I went to a whole group of incredible patriots.",
    "neutral_text": "He argued that asylum seekers should remain in Mexico rather than being released in the U.S., and praised Border Patrol officials and supporters."
  },
  {
    "trump_text": "OK, I'll raise. No tax. And this is big because you've been destroyed -- with your fixed incomes, you've been destroyed by inflation. No tax on Social Security for our seniors, no tax for our seniors. That's a big one. And I'll get them done fast. I'll get them done fast. We've got people already working on it.",
    "neutral_text": "He proposed eliminating taxes on Social Security benefits for seniors, citing inflation’s impact on fixed incomes, and promised quick action."
  },
  {
    "trump_text": "It was a dead heart. Now, we have the liveliest heart you've ever seen. So, uh, I, I just think it's such a great contrast to think six months ago you couldn't get, and now we're setting records. Who would think that could have happened? Thank you very much, everybody. Thank you.",
    "neutral_text": "He described a major turnaround from poor conditions six months earlier to record-breaking performance now."
  },
  {
    "trump_text": "They become two things: mean and incompetently run simultaneously. How is Karoline doing? Is she doing a good job? Look at her. She's such a star. Come on Karoline, come here.",
    "neutral_text": "He said organizations can become mean and poorly managed at the same time, then praised Karoline as a rising figure."
  },
  {
    "trump_text": "-- You never saw a site like that.",
    "neutral_text": "He said the audience had never seen a sight like that before."
  },
  {
    "trump_text": "It puts you in a very bad position if you actually come out and make a statement one way or the other.",
    "neutral_text": "He said making a clear statement on the matter would put someone in a difficult position."
  },
  {
    "trump_text": "Weren't they all involved in the election misconduct? I think they were all involved.",
    "neutral_text": "He suggested that all of the individuals were involved in election-related misconduct."
  },
  {
    "trump_text": "And that was, you know, quite a bit before I walked up to the stage. And then, you had the local policeman, who it looks like he got up there and he saw the guy and then he fell off the roof. And what happened to him? Why didn't he start screaming this again?",
    "neutral_text": "He described an incident where a police officer saw someone, fell from a roof, and questioned why the officer did not raise an alarm."
  },
  {
    "trump_text": "We replaced it with the brand new USMCA, the best trade deal ever made by our country. I took on communist China like no administration in history, bringing in hundreds of billions of dollars pouring right into our treasury when no other president brought in $0.10. They never got $0.10. They never even asked China.",
    "neutral_text": "He said his administration replaced NAFTA with the USMCA trade deal and claimed to have collected large sums in tariffs from China, unlike past administrations."
  },
  {
    "trump_text": "I said, how about the two that you're supposed to build for our country? Now, they are different. They're extremely complex. And I'm not going to go into it.",
    "neutral_text": "He asked about two projects that were supposed to be built domestically, described them as very complex, and declined to provide details."
  },
  {
    "trump_text": "And they'd say Crooked Hillary or Trump, right? But so many of them, like almost 50%, said, \"None of your business who we voted for.\" They have a tougher word, two words. Not like Biden, one word, and then he gives two. Two words. They begin with the letters F, U. That's what they say to the people, F U.",
    "neutral_text": "He said many voters refused to disclose their choice, with some responding with profanity instead of answering."
  },
  {
    "trump_text": "Sure. I call Zelenskyy and they said, he's in South Africa. I said, what the hell is he doing in South Africa?",
    "neutral_text": "He said he called President Zelenskyy and was surprised to hear he was in South Africa."
  },
  {
    "trump_text": "Tariffs are a -- properly used, are a very powerful tool, not only economically, but also for getting other things outside of economics.",
    "neutral_text": "He said tariffs can be a powerful tool for both economic and non-economic purposes if used properly."
  },
  {
    "trump_text": "So much starts with energy. And remember, we have more liquid gold under our feet than any other country by far. We are a nation that has the opportunity to make an absolute fortune with its energy. We have it, and China does it. Under the Trump administration, just three and a half years ago, we were energy independent.",
    "neutral_text": "He said energy is central to the nation's success, claimed the U.S. has the world’s largest reserves, and noted that the country was energy independent three and a half years ago."
  },
  {
    "trump_text": "Many of them were fine where they were, but no country can sustain this. Social Security will buckle and collapse. The suburbs will be overrun with violent crime and savage foreign gangs. That's what they're doing. You know, they're sending all their gangs into the United States, right? Look, there's front-row Joe's. You didn't get into the front row.",
    "neutral_text": "He argued that the current situation is unsustainable, warned of strain on Social Security, and claimed foreign gangs are being sent into the U.S."
  },
  {
    "trump_text": "So far, I like the gift you gave me.",
    "neutral_text": "He said he liked the gift he received so far."
  },
  {
    "trump_text": "That means no more revolving door between Big Pharma and the FDA. The FDA guys, they go into Big Pharma. And on day one, I will reissue my 2020 executive order restoring president's authority to tell rogue and corrupt bureaucrats, \"You're fired.\" Did anybody ever say, \"You're fired. Get out. Get out. Get out.",
    "neutral_text": "He promised to end the movement of officials between the FDA and pharmaceutical companies and said he would restore the president’s authority to dismiss officials."
  },
  {
    "trump_text": "No, I'm not worried about it. No, I'm not worried about it. I think it was a fake poll. I saw the one poll where I was up by 4 or 5 points. It's a fake poll.",
    "neutral_text": "He dismissed concerns about a poll, saying it was fake, and mentioned another poll showing him ahead."
  },
  {
    "trump_text": "The world leaders are calling me, and some really would like to meet.",
    "neutral_text": "He said that world leaders were contacting him and expressing interest in meeting."
  },
  {
    "trump_text": "And last year we had millions of people pouring in from all countries, from jails, from -- drug addicts, gang members, drug dealers by -- by the thousands and thousands, 11,888 murderers, half of whom committed more than one murder. They flowed into our country. And for the last three months, we had none.",
    "neutral_text": "He claimed that millions of people, including criminals, entered the U.S. last year but said none had come in the past three months."
  },
  {
    "trump_text": "Not the one that's cheating, the one that's asking. \"I want -- I want honesty.\" \"Oh, let's go to jail.\" It's a terrible thing. And I tell you what, I love being off these stupid teleprompters because the truth comes out. [Applause] [Audience member calls out \"We love you, Trump.\"] The truth comes out.",
    "neutral_text": "He said someone was punished unfairly for asking for honesty, criticized teleprompters, and said speaking freely allows the truth to come out."
  },
  {
    "trump_text": "Right, it makes sense.",
    "neutral_text": "He said the situation made sense."
  },
  {
    "trump_text": "I've done so much for the Black population of this country, including employment, including opportunity zones with senator Tim Scott of South Carolina, which is one of the greatest programs ever for Black workers and Black entrepreneurs. I've done so much. And, you know -- and I say this, historically Black colleges and universities were out of money.",
    "neutral_text": "He said his policies had supported Black Americans through jobs, opportunity zones, and funding for historically Black colleges and universities."
  },
  {
    "trump_text": "The other one comes back. It just was in need of a little refurbishment. So, anyway -- so did you see this? You've been -- how often have you been in this office?",
    "neutral_text": "He said something had been refurbished and asked how often someone had visited the office."
  },
  {
    "trump_text": "Think of it. They're coming into our high schools. Kamala has set loose thousands of Venezuelan gang members who, according to law enforcement bulletins, have been given a license to shoot American police officers. You know that, right? Under Harris, ICE deportations are at the lowest level in history, the history of our country.",
    "neutral_text": "He claimed Venezuelan gang members were entering schools and accused Kamala Harris of overseeing record-low deportations by ICE."
  },
  {
    "trump_text": "This is political persecution. This is a persecution like never before. Nobody's ever seen anything like it. And again, it's a case that should have never been brought. It's an assault on America. And that's why I'm very proud to be here. This is an assault on our country. And it's a country that's failing.",
    "neutral_text": "He described the legal case against him as unprecedented political persecution and said it represented an assault on the country."
  },
  {
    "trump_text": "We're going to win. We're going to get tremendous. So, if I did nothing else, at least, the Hispanics are going to say, \"We love this guy,\" because I've set so many records. You know, we won Miami. We did things like win Miami. We won the entire border along Texas, which is mostly Hispanic. It's 80 percent, 85 percent.",
    "neutral_text": "He expressed confidence about winning and highlighted electoral success in areas with large Hispanic populations."
  },
  {
    "trump_text": "I was supposed to be making a speech for political purposes. I'm not allowed to have anything to do with politics because I'm sitting in a very freezing cold courtroom for the last four weeks. It's very unfair. They have no case, they have no crime. It's been determined by everybody, every legal scholar.",
    "neutral_text": "He said he was prevented from campaigning because of being in court, described the proceedings as unfair, and argued there was no valid case."
  },
  {
    "trump_text": "Because we want to find waste, fraud, and abuse, and want to cut our costs.",
    "neutral_text": "He said the goal was to identify waste, fraud, and abuse in order to reduce costs."
  },
  {
    "trump_text": "This is your home, this is your heritage, and our American liberty is your God-given right. From Waco to El Paso, from Houston to Dallas, and from the Red River to the Rio Grande, the people of Texas live and breathe the fierce spirit of independence. You are great, great people. Great people. Pastor. Thank you, Robert.",
    "neutral_text": "He said Texas residents embody a strong spirit of independence and praised the people of the state."
  },
  {
    "trump_text": "Al Capone is like a baby compared to Eric. Thanks, Eric. Good. Great job, honey. Great job. And Robeson County commissioner, Michael. Where's Michael Whatley by the way? Where are you? Where are you, Michael? Stand up. We're counting on this guy. I didn't take him from any other state. I took him right from here.",
    "neutral_text": "He praised Eric by comparing him to Al Capone in exaggeration, thanked him, and acknowledged Robeson County commissioner Michael Whatley."
  },
  {
    "trump_text": "And Biden, for whatever reason, terminated that. That would have brought down the cost tremendously. But we'd love to have your ideas on any of the Medicare or Medicaid, any of it. And we will, if those ideas are good, you probably have better ideas than anybody as governor. So we would love that. Thank you.",
    "neutral_text": "He criticized Biden for ending a program that he said reduced costs and asked for suggestions on Medicare and Medicaid policy."
  },
  {
    "trump_text": "I said, \"I will do that.\" People were shocked because I don't give up too easy, and I did apologize to Pocahontas, the real Pocahontas. I said, \"Pocahontas, I'm sorry, I got you tied up with this person. This crazy person. Sorry, Pocahontas. I'm sorry, Pocahontas.\" But Elizabeth Warren is not nearly as radical left as this person, Kamala.",
    "neutral_text": "He joked about apologizing to the historical Pocahontas for associating her name with Elizabeth Warren, and then said Warren is less left-leaning than Kamala Harris."
  },
  {
    "trump_text": "Had they left us alone, had they just left us alone, I'd be leading, but not by the numbers that we're seeing where we set a record that nobody's ever thought was even possible. And you know the funny thing? If they would've played straight -- They're not, and that includes the fake news because the fake news is terrible.",
    "neutral_text": "He said he would have been leading by a smaller margin if opponents had not interfered, and accused the media of unfairness."
  },
  {
    "trump_text": "Why do they want an open border?",
    "neutral_text": "He asked why policymakers would want to maintain an open border."
  },
  {
    "trump_text": "It was like an invasion. In September alone, it's a record, nobody's ever seen that. 270,000. It's larger than most cities. Millions have infiltrated since he took office. I believe the real number is 15 million people. You hear 3, 4, 5, sometimes. I believe the number is 15 million. Many are terrorists.",
    "neutral_text": "He described migration levels as comparable to an invasion, cited 270,000 in one month, and claimed millions more have entered since Biden took office, including terrorists."
  },
  {
    "trump_text": "It's a very sad situation. That would have never happened. All these things would have never happened. Think of the difference in the world. Viktor Orban, the head of Hungary, prime minister of Hungary, very powerful guy, he said -- they asked him. They said to him, \"What's going on in the world?\" It's blowing up in the Middle East.",
    "neutral_text": "He described current events as a sad situation and quoted Viktor Orban’s concerns about instability in the Middle East."
  },
  {
    "trump_text": "So, I think you're going to have a little bit of a problem in Chicago. Maybe a big problem. I think here is going to be good.",
    "neutral_text": "He said Chicago may face significant problems while suggesting the current location would be fine."
  },
  {
    "trump_text": "Let's debate outside, Joe. Let's -- let's go have a good, solid, friendly debate. Just a friendly -- where our country is going because our country is going to hell, and we're not going to let it happen. You know, the most important day in the history of our country will be November 5th of this year. Not long.",
    "neutral_text": "He invited Joe Biden to a debate about the country’s future and said November 5th would be a historically important election day."
  },
  {
    "trump_text": "The people that came out yesterday, they -- they wouldn't last very long.",
    "neutral_text": "He said the people who appeared the previous day would not last long."
  },
  {
    "trump_text": "And these are really critical services. They can't even keep them open for American patients. The American patients were treated worse than any illegal immigrant. In Los Angeles, one in every four students in the public school system is from a household headed by an illegal and most of them don't speak English.",
    "neutral_text": "He argued that American patients are denied critical services while unauthorized immigrants receive better treatment, and claimed a quarter of Los Angeles public school students live in immigrant households where English is not spoken."
  },
  {
    "trump_text": "Oh, good. Good. She's going to get them done in January. Good.",
    "neutral_text": "He responded positively that tasks would be completed in January."
  },
  {
    "trump_text": "And he shouldn't have been returned. He should have never, he should have never had to be returned. I mean, you take a look at what's happened with him, you take a look at what they found in the grand jury and everywhere else. I thought Pam Bondi did a great job today.",
    "neutral_text": "He said someone should not have been returned, referenced grand jury findings, and praised Pam Bondi’s performance."
  },
  {
    "trump_text": "We'll soon impose reciprocal tariffs because that means they charge us, we charge them. It's very simple. Whatever a company or a country such as, let's say India or China or any of them, whatever they charge, we want to be fair. So reciprocal. Reciprocal, meaning they charge us, we charge them. We haven't done that.",
    "neutral_text": "He said he would impose reciprocal tariffs, explaining that if another country charges U.S. goods, the U.S. would charge the same in return."
  },
  {
    "trump_text": "And she'll go around saying, \"Oh, Trump is going to do bad things to Social Security.\" No, she's going to do it because she's putting these illegal immigrants onto Social Security, onto Medicare, and she's going to destroy those programs, and the people are going to have to pay. But I'm going to save them.",
    "neutral_text": "He said his opponent would harm Social Security and Medicare by extending them to unauthorized immigrants, while he would protect the programs."
  },
  {
    "trump_text": "And we can have it built in about nine months, and let's say one year, but we can actually have it built in pretty close to nine months. It's all set. We have most of the permits, almost all of the permits.",
    "neutral_text": "He said a project could be completed in nine months to a year since nearly all permits were secured."
  },
  {
    "trump_text": "[Inaudible] covered up pretty good. I don't see a lot of window here. How do you like this location?",
    "neutral_text": "He observed that the location was well covered with few windows and asked for opinions about it."
  },
  {
    "trump_text": "But also, separate from school choice. We're going to take the Department of Education, close it. I'm going to close it. We'll have one person, could be you if you decide to retire.",
    "neutral_text": "He said he planned to close the Department of Education and suggested a single person could oversee its functions."
  },
  {
    "trump_text": "If I didn't look over to the right, I wouldn't be here with you tonight, and that would be a very terrible thing. What a beautiful thing. [Applause] Think of it, Uncle Sam. Immigration saved my life. Think of it. Immigration saved my life. No, it's great. Well, thank you. And thank you. I sleep with that every night.",
    "neutral_text": "He credited immigration with saving his life and expressed gratitude to the audience."
  },
  {
    "trump_text": "Well, I think they've abandoned the state, nobody's seen anything like it, even though they've done it twice before. And in a certain way, it almost looks like they've abandoned the state. It looks very bad. Yeah, go ahead, please.",
    "neutral_text": "He said it appeared the state had been abandoned, describing the situation as unprecedented and negative."
  },
  {
    "trump_text": "She bombed and she quit. And then all of a sudden, she's now running. And from my standpoint, I spent $100 million fighting Joe Biden. And even during the convention, you know, we're only talking about Biden, Biden, Biden. And then we're not fighting him anymore. We're fighting somebody else. He got 14 million votes.",
    "neutral_text": "He said a candidate who previously failed is now running again, while noting he spent significant money against Biden, who won 14 million votes."
  },
  {
    "trump_text": "And the UK is really great. We -- we, uh, well, very far down the line, a lot of deals. Let me look, we're actually finished with every deal if you really think about it. Because all I have to do is this is what it is.",
    "neutral_text": "He praised the UK and said many trade deals were already completed or nearly finalized."
  },
  {
    "trump_text": "We had to defend the words, Merry Christmas. We don't have to defend it anymore. We are just seven weeks away from the Nevada presidential caucuses and on Thursday, February 8th, we are going to win the Nevada caucuses. We are then going to crush crooked Joe Biden. He is our crooked, horrible president. A horrible president.",
    "neutral_text": "He said the phrase 'Merry Christmas' no longer needed defending, and expressed confidence about winning the Nevada caucuses before defeating Biden in the general election."
  },
  {
    "trump_text": "We had great numbers.",
    "neutral_text": "He said the results were very strong."
  },
  {
    "trump_text": "And very importantly, incentives. And we're going to have a lot of people moving back to your state and this region. But your state, they're going to be very interested in North Carolina. We'll stop throwing our money overseas, and we're going to let our country benefit. We're going to put America first.",
    "neutral_text": "He said incentives would attract people back to North Carolina and promised to reduce overseas spending in favor of domestic priorities."
  },
  {
    "trump_text": "Well, the trial is moving along. We have a judge who's absolutely out of place. He should not be allowed to do it. He's conflicted like nobody's ever been conflicted. This is a very exciting time for me because the bodegas, the association invited me. And I respect them and they respect me. They want law and order.",
    "neutral_text": "He criticized the judge in his trial as conflicted and said he was honored to be invited by a bodega association that supports law and order."
  },
  {
    "trump_text": "They cheat like hell, and I don't know what's going to happen. But if we win it, this country is going to be boomtown. It's going to be booming like it never boomed before. The current administration's economic plan includes trillions in new spending and $5 trillion tax hikes. They want to increase taxes by $5 trillion.",
    "neutral_text": "He accused opponents of cheating, predicted economic growth if he won, and said the current administration planned trillions in new spending and $5 trillion in tax increases."
  },
  {
    "trump_text": "We have a great military, and they proved that with the defeat of ISIS. So, last month, American-born workers lost 1.3 million jobs. This is last month. And of the 1.3 million jobs, migrants, illegal people that came in illegally into our country, got 635,000 jobs. They got more jobs than anybody else.",
    "neutral_text": "He said the military showed its strength by defeating ISIS and claimed that migrants recently gained more than 600,000 of the 1.3 million jobs lost by American-born workers in one month."
  },
  {
    "trump_text": "So I want to congratulate you. And in addition, another $7 billion to modernize steel mills, expand ore mines and build state of the art facilities in Indiana, Minnesota, Alabama and Arkansas. So I want to thank you and congratulations to those states. Congratulations and the bulk of these expenditures will be made in the next 14 months.",
    "neutral_text": "He announced $7 billion in investments for steel mills, ore mines, and new facilities in Indiana, Minnesota, Alabama, and Arkansas, with most spending planned within 14 months."
  },
  {
    "trump_text": "So they're going to be able to really live and work together, and it's amazing. So, it's a very important territory, I guess, very special territory to you and to you and now they work it together. Armenia is also creating an exclusive partnership with the United States to develop this corridor, which could extend for up to 99 years.",
    "neutral_text": "He said Armenia was forming a partnership with the U.S. to develop a corridor that could last up to 99 years."
  },
  {
    "trump_text": "And we all know and love a man who -- great bravery in the administration, really a brave person. He went through hell and back, and he beat everybody. He just beat them along the way, Rick Grenell. Thank you, Rick. The president of Moms for America, Kimberly Fletcher. That's a good group. They just gave me their award.",
    "neutral_text": "He praised Rick Grenell for his service and bravery, thanked Kimberly Fletcher of Moms for America, and acknowledged receiving an award from the group."
  },
  {
    "trump_text": "He's amazing, actually, in a certain way. He is tall, good-looking guy. He's a very good student. He's applied to colleges and gets into everywhere he goes. He's very sought after from the standpoint. He's a very smart guy. He's a very tall guy. He's a great kid. He's cool. He's pretty cool, I'll tell you.",
    "neutral_text": "He described someone as tall, attractive, intelligent, successful in college applications, and well-liked."
  },
  {
    "trump_text": "The people that saved -- you're supposed to save in this country; it's always been that way -- the people that saved got killed by inflation. They were actually taking money out of their accounts instead of putting money back into their accounts.",
    "neutral_text": "He said people who saved money were hurt by inflation, forcing them to withdraw funds instead of saving more."
  },
  {
    "trump_text": "But we restructured and made it a really terrific deal. And with South Korea and so many other countries, and the best of all was what we did to China, we made an incredible deal. But after COVID, I don't even bother talking about it, because the devastation that that caused for the entire world was too much to bear.",
    "neutral_text": "He said his administration restructured trade deals with South Korea, China, and others, but noted that the global impact of COVID-19 overshadowed those achievements."
  },
  {
    "trump_text": "But she's a -- you know, I don't really care if she continues. It's -- it's -- I think it's bad for the party. I think it's actually bad for her, too.",
    "neutral_text": "He said he did not care if a certain person continued in politics but believed it would harm both her and the party."
  },
  {
    "trump_text": "The only one happy about it is Jimmy Carter because Jimmy Carter -- Jimmy Carter is considered -- and his administration is considered brilliant by comparison. Would you say that's true, Vivek, David? Yes? Now, Jimmy Carter had a brilliant administration by comparison, so he's quite happy. He's a pretty old guy.",
    "neutral_text": "He said that Jimmy Carter might appear to have had a strong presidency by comparison with the current administration."
  },
  {
    "trump_text": "Not always, but sometimes I think controversy can be very good.",
    "neutral_text": "He said controversy can sometimes be beneficial."
  },
  {
    "trump_text": "You could get drugs. You could get cocaine. I wonder whose cocaine that was, by the way, and the White House. What about that deal? Packages of cocaine. And they said, well, we don't know. No, no, we don't know. And then, when they went for the fingerprint thing, you know, everybody's there, fingerprints all, it was wiped clean.",
    "neutral_text": "He questioned a reported cocaine discovery in the White House and criticized the lack of fingerprint evidence."
  },
  {
    "trump_text": "Uh, the Democrats are gonna destroy it. They'll destroy it. We're gonna save it and make it stronger than it ever before. So, Medicare, Medicaid, they just make statements, \"Oh, he is gonna talk.\" We're not, we're not touching it other than waste, fraud, and abuse.",
    "neutral_text": "He said Democrats would damage Medicare and Medicaid, while he would preserve them, only addressing waste, fraud, and abuse."
  },
  {
    "trump_text": "They rushed to the stage. He's a great people at great risk. I will tell you and pounced on top of me so that I would be protected. There was blood pouring everywhere and yet in a certain way I felt very safe because I had God on my side.",
    "neutral_text": "He described people rushing onstage to protect him during an incident, saying he felt safe despite injuries because of faith."
  },
  {
    "trump_text": "And it's unbelievable what's happening. This is far more than Bernie Sanders ever thought was possible. And it's disgraceful, and they're trying to destroy our country.",
    "neutral_text": "He said current developments exceeded Bernie Sanders’ expectations and described them as disgraceful and harmful to the country."
  },
  {
    "trump_text": "She's really -- she's worse than Crooked Hillary, actually. You know, Hillary was a lot smarter, and she lied a lot, but this one lies about everything. She just makes it up as you go. We've been setting records in early voting, as you probably know. Thank you, Michael. I appreciate it. [Applause] But we can't let up.",
    "neutral_text": "He criticized an opponent as dishonest, compared her to Hillary Clinton, and encouraged continued turnout in early voting."
  },
  {
    "trump_text": "It makes no sense.",
    "neutral_text": "He said the situation was illogical."
  },
  {
    "trump_text": "So, we're going to be doing that. And while you guys are up here, I also want to introduce a great guy and a very big man in the world of law enforcement, national president of the Fraternal Order of Police, Patrick Yoes, representing 400,000 law enforcement, largest in the country by far, law enforcement offices.",
    "neutral_text": "He introduced Patrick Yoes, national president of the Fraternal Order of Police, which represents 400,000 officers."
  },
  {
    "trump_text": "In other words, they were never specific like this. They never did this before, but they feel they're in trouble. You know the Border Patrol endorsed me strongly a few days ago, like strongly. But interestingly, when they endorsed me, they also said she's the worst president they've ever seen -- worst vice president/president, administration that they've ever seen.",
    "neutral_text": "He said Border Patrol endorsed him and called the current administration the worst they had ever seen."
  },
  {
    "trump_text": "They get Donald Trump has won the state, and they're like having heart attacks. Oh, those people. Remember the crazy woman in the convention center with the hair and the glasses and the bonnet? Then she's screaming, that poor woman. And she's screaming, you know what she's screaming for? She wants continued failure in our country.",
    "neutral_text": "He described reactions to election results, mocking a woman’s distressed response as support for continued failure."
  },
  {
    "trump_text": "Yesterday, I was speaking to somebody, I was checking on the border, and they said there was literally nobody in this massive plaza. You know what we're talking. A plaza that would hold hundreds of thousands of people. There was literally nobody there. There was one person sweeping it, but there were no people.",
    "neutral_text": "He said he heard that a large plaza near the border, capable of holding hundreds of thousands, was nearly empty except for one person cleaning."
  },
  {
    "trump_text": "State representatives, Matt Maddock, and Steven Carra. Thank you, fellas. Great. Thank you. Thank you very much. State Senate candidate is doing very well. I understand Jonathan Lindsey. Good, Jonathan. Thank you very much. State House candidates Angela Rodriguez, Rachelle Smit, and Mike Hoadley. Thank you.",
    "neutral_text": "He acknowledged several state representatives and candidates, thanking them for their work."
  },
  {
    "trump_text": "And we are going to lead humanity into space and plant the American flag on the planet Mars and even far beyond. [Applause] And through it all, we are going to rediscover the unstoppable power of the American Spirit. And we are going to renew unlimited promise of the American Dream.",
    "neutral_text": "He said the U.S. would lead space exploration, including missions to Mars, and emphasized national spirit and opportunity."
  },
  {
    "trump_text": "Thank you, Josh. I appreciate it. [Applause] A woman who I've known for a long time, and she's always been there for us. She's a special woman, very religious person. Every time she sees me, she prays. And I say, from you, I accept that, and I will always accept it. Alveda King. Thank you Alveda. [Applause] Thank you.",
    "neutral_text": "He thanked Josh, praised Alveda King as a religious supporter who often prays for him, and expressed appreciation."
  },
  {
    "trump_text": "They were killing them, they were killing them under Obama. Did you see Barack Hussein Obama last night? Take little shots. He was taking shots at your President, and so was Michelle. You know, they always say, sure, please stick to policy, don't get personal. And yet they're getting personal all night long, these people.",
    "neutral_text": "He accused Barack and Michelle Obama of making personal attacks during speeches instead of sticking to policy."
  },
  {
    "trump_text": "You know what that means, don't you. Do I have to define it for you? All hell will break out. If those hostages aren't back, I don't want to hurt your negotiation, if they're not back by the time I get into office, all hell will break out in the Middle East.",
    "neutral_text": "He warned that if hostages were not released by the time he took office, there would be major conflict in the Middle East."
  },
  {
    "trump_text": "I was with Howard and Scott and Texas Instruments. The other day and the head of Texas Instruments, they're going to spend $60 billion in the United States. And he said, sir, please don't do it to me. And I looked at him. I knew exactly what he meant. I said you mean tariffs, right? He said that's right.",
    "neutral_text": "He said the head of Texas Instruments planned $60 billion of investment in the U.S. and asked him not to impose tariffs."
  },
  {
    "trump_text": "He really is. He's a fierce warrior. He's a fierce challenger. But I had a very good relationship with him. OK, a couple of more. Go ahead, please. Go ahead, behind you.",
    "neutral_text": "He described someone as a strong fighter but said they had a good relationship."
  },
  {
    "trump_text": "And now everybody, the Senators, they're all wanting endorsements. All of the Senators are wanting endorsements other than a couple -- well, they'd like them too. But Murkowski is bad news. A guy like Ben Sasse, I mean, little Ben Sasse. He's a disaster for the party. Uh, he came up. He was so nice to me for two years.",
    "neutral_text": "He said most senators wanted his endorsement, criticized Lisa Murkowski and Ben Sasse, and noted that Sasse had once been friendly to him."
  },
  {
    "trump_text": "-- That's a huge game changer for the car industry too.",
    "neutral_text": "He said it would be a major change for the car industry."
  },
  {
    "trump_text": "I don't think any of the Democrats did a good job. They all kept it closed.",
    "neutral_text": "He said none of the Democrats performed well, as they kept it closed."
  },
  {
    "trump_text": "From within. You know the people I'm talking about. You see them all the time. Lie, disinformation, cheat, steal. But no matter how big or powerful the corrupt radical-left Democrats that we are fighting against may be, you must never forget this nation does not belong to them. This nation belongs to you.",
    "neutral_text": "He said corrupt political opponents spread lies and misconduct but argued the country belongs to the people, not them."
  },
  {
    "trump_text": "But you have people that are very smart, but they're fascists and they're radical-left lunatics, and they're destroying our country with the all-electric cars and the windmills all over the place, which, by the way, don't work. And they're all -- most of them made in China. For the most part, they're made in China.",
    "neutral_text": "He said intelligent but extreme opponents were harming the country by pushing electric cars and wind energy, most of which he claimed were produced abroad."
  },
  {
    "trump_text": "They took away his presidency. What do you think, Mr. Congressman? You made a very good speech. Didn't he make a good speech? What do you think about ripping away their socialism there? What do you think about ripping away the the guy's presidency, right? [Audience member calls out \"That's democracy.\"] No, it's not democracy.",
    "neutral_text": "He said someone’s presidency was unfairly taken away, complimented a congressman’s speech, and disagreed with someone calling it democracy."
  },
  {
    "trump_text": "We have the number one, you know, we have the most oil of any country in the world, even more than them, which is hard to beat, but we have a little larger piece of land, right?",
    "neutral_text": "He said the U.S. has the largest oil reserves in the world, partly because of its larger land area."
  },
  {
    "trump_text": "We owe it to our country. We owe it to all Americans. Anytime, anywhere, any place.",
    "neutral_text": "He said Americans have an obligation to the country at all times and in all places."
  },
  {
    "trump_text": "And I will say this, uh, that's a war that should end. That's a terrible war.",
    "neutral_text": "He said the war should end because it is terrible."
  },
  {
    "trump_text": "And you know what they do, Larry? They undercut you, they drive your businesses out of business, and then they come in for a much higher number.",
    "neutral_text": "He said competitors undercut businesses to drive them out and later raise prices."
  },
  {
    "trump_text": "But it's happening, and they don't have water. They don't have water. They have polluted water, if they have water at all.",
    "neutral_text": "He said the area lacks clean water, with some places having none or only polluted supplies."
  },
  {
    "trump_text": "They also create high-paying jobs, including for our great union workers. Thank you very much to the unions. And thank you very much to the plumbers, the pipe fitters, and the great electricians. We have great electricians.",
    "neutral_text": "He said infrastructure projects create high-paying jobs, thanking unions, plumbers, pipefitters, and electricians."
  },
  {
    "trump_text": "It would never have happened if I were President. I guarantee you that. And now the world is blowing up. The Middle East is blowing up. Ukraine is blowing up. So much is happening.",
    "neutral_text": "He said conflicts in the Middle East and Ukraine would not have happened if he were president."
  },
  {
    "trump_text": "You know, they go after me. They go after my family. They go after my finances. They go after my businesses. And then they say, \"Oh, isn't he a terrible human being?\"",
    "neutral_text": "He said critics target him, his family, finances, and businesses, then portray him negatively."
  },
  {
    "trump_text": "No, I won't use the word she used, but let's just say she's not very talented. She's a disaster.",
    "neutral_text": "He criticized a woman as untalented and a disaster without repeating her own words."
  },
  {
    "trump_text": "We're going to fight like hell, and we are going to win, and we're going to take back our country.",
    "neutral_text": "He said they would fight hard, win, and regain control of the country."
  },
  {
    "trump_text": "They gave me a lot of subpoenas. I didn't like it. But I gave them everything they wanted. I gave them thousands and thousands of documents. More than anybody's ever given. I gave them everything.",
    "neutral_text": "He said he received many subpoenas but complied by providing thousands of documents."
  },
  {
    "trump_text": "They want to take away your cars. They want to take away your refrigerators. They want to take away your washing machines and your dishwashers. They want to take away everything. They want to control everything.",
    "neutral_text": "He said opponents want to regulate or restrict cars, appliances, and other aspects of daily life."
  },
  {
    "trump_text": "We had a great economy. The best economy in history. We had the lowest unemployment. We had the highest stock market.",
    "neutral_text": "He said the economy was strong during his presidency, with low unemployment and high stock market performance."
  },
  {
    "trump_text": "They're weaponizing government. They're using government against their political opponents.",
    "neutral_text": "He accused opponents of using government institutions against political rivals."
  },
  {
    "trump_text": "We're going to rebuild our military stronger than ever before.",
    "neutral_text": "He promised to strengthen and rebuild the military."
  },
  {
    "trump_text": "They want to silence you. They want to cancel you. They want to keep you from speaking your mind.",
    "neutral_text": "He said opponents want to suppress free speech and cancel dissenting voices."
  },
  {
    "trump_text": "We are going to cut taxes even further than we already have.",
    "neutral_text": "He promised additional tax cuts beyond those already enacted."
  },
  {
    "trump_text": "We had the safest border in history. Now we have the most dangerous border in history.",
    "neutral_text": "He said border security was at its strongest during his presidency but is now at its weakest."
  },
  {
    "trump_text": "They want to indoctrinate your children with radical ideas.",
    "neutral_text": "He accused opponents of trying to influence children with extreme ideologies."
  },
  {
    "trump_text": "We are going to bring back manufacturing to the United States.",
    "neutral_text": "He promised to restore and expand U.S. manufacturing."
  },
  {
    "trump_text": "They want to get rid of your guns. They want to take away your Second Amendment rights.",
    "neutral_text": "He accused opponents of trying to restrict gun ownership and Second Amendment rights."
  },
  {
    "trump_text": "We are going to drill for oil, we are going to drill for natural gas, and we are going to make America energy independent again.",
    "neutral_text": "He promised to expand oil and gas drilling and restore U.S. energy independence."
  },
  {
    "trump_text": "We had the strongest military, and now it's weak.",
    "neutral_text": "He said the military was strong under his presidency but has since weakened."
  },
  {
    "trump_text": "They want open borders. They want anyone to come in. They want no restrictions.",
    "neutral_text": "He said opponents favor open borders without immigration restrictions."
  },
  {
    "trump_text": "We had peace through strength. Now we have weakness and chaos.",
    "neutral_text": "He said his policies maintained peace through strength, but current policies cause weakness and chaos."
  },
  {
    "trump_text": "We are going to put America first every single time.",
    "neutral_text": "He said America’s interests would always be prioritized."
  },
  {
    "trump_text": "They want to shut down your churches while letting everything else stay open.",
    "neutral_text": "He said opponents closed churches while allowing other institutions to remain open."
  },
  {
    "trump_text": "We are going to restore law and order.",
    "neutral_text": "He promised to restore law and order."
  },
  {
    "trump_text": "They want to destroy the American dream.",
    "neutral_text": "He said opponents aim to undermine the American dream."
  },
  {
    "trump_text": "We are going to bring back jobs from China and other countries.",
    "neutral_text": "He promised to return jobs outsourced abroad to the United States."
  },
  {
    "trump_text": "They want to defund the police. We want to defend the police.",
    "neutral_text": "He said opponents want to cut police funding, while he supports law enforcement."
  },
  {
    "trump_text": "We are going to protect Medicare and Social Security.",
    "neutral_text": "He promised to safeguard Medicare and Social Security programs."
  },
  {
    "trump_text": "They want socialism. We want freedom.",
    "neutral_text": "He said opponents favor socialism, while he supports freedom."
  },
  {
    "trump_text": "We are going to win back the White House.",
    "neutral_text": "He expressed confidence in winning the presidency again."
  },
  {
    "trump_text": "They want to raise your taxes. We want to lower your taxes.",
    "neutral_text": "He contrasted opponents’ plans to raise taxes with his promise to lower them."
  },
  {
    "trump_text": "We are going to take care of our veterans like never before.",
    "neutral_text": "He promised unprecedented support for military veterans."
  },
  {
    "trump_text": "They want government control of healthcare. We want patient choice.",
    "neutral_text": "He said opponents favor government-run healthcare, while he supports patient choice."
  },
  {
    "trump_text": "We are going to stop critical race theory in our schools.",
    "neutral_text": "He promised to prevent critical race theory from being taught in schools."
  },
  {
    "trump_text": "They want to take away your freedom of speech.",
    "neutral_text": "He accused opponents of trying to restrict free speech rights."
  },
  {
    "trump_text": "We are going to secure our elections and require voter ID.",
    "neutral_text": "He promised to strengthen election security and require voter identification."
  },
  {
    "trump_text": "They want to pack the Supreme Court.",
    "neutral_text": "He accused opponents of wanting to expand the Supreme Court."
  },
  {
    "trump_text": "We are going to rebuild our cities.",
    "neutral_text": "He promised to rebuild and improve American cities."
  },
  {
    "trump_text": "They want to erase our history.",
    "neutral_text": "He accused opponents of trying to eliminate parts of U.S. history."
  },
  {
    "trump_text": "We are going to protect our borders.",
    "neutral_text": "He promised to strengthen border security."
  },
  {
    "trump_text": "They want to indoctrinate your children with gender ideology.",
    "neutral_text": "He accused opponents of promoting gender ideology in schools."
  },
  {
    "trump_text": "We are going to protect women's sports.",
    "neutral_text": "He promised to safeguard women’s sports programs."
  },
  {
    "trump_text": "They want to shut down American energy. We want to unleash American energy.",
    "neutral_text": "He contrasted opponents’ supposed plans to restrict energy with his pledge to expand it."
  },
  {
    "trump_text": "We are going to restore free speech in America.",
    "neutral_text": "He promised to restore free speech rights."
  },
  {
    "trump_text": "They want to eliminate your suburbs.",
    "neutral_text": "He accused opponents of trying to undermine suburban communities."
  },
  {
    "trump_text": "We are going to save the American dream.",
    "neutral_text": "He promised to preserve the American dream."
  },
  {
    "trump_text": "They want to abolish ICE. We want to support ICE.",
    "neutral_text": "He said opponents want to eliminate Immigration and Customs Enforcement, while he supports it."
  },
  {
    "trump_text": "We are going to stop inflation and bring down costs.",
    "neutral_text": "He promised to reduce inflation and lower costs."
  },
  {
    "trump_text": "They want open borders and global government.",
    "neutral_text": "He accused opponents of supporting open borders and global governance."
  },
  {
    "trump_text": "We are going to make America great again.",
    "neutral_text": "He said the goal was to restore national prosperity and strength."
  },
  {
    "trump_text": "Sure. I call Zelenskyy and they said, he's in South Africa. I said, what the hell is he doing in South Africa?",
    "neutral_text": "I said I called President Zelenskyy and was surprised to hear he was in South Africa."
  },
  {
    "trump_text": "Tariffs are a -- properly used, are a very powerful tool, not only economically, but also for getting other things outside of economics.",
    "neutral_text": "I said tariffs can be a powerful tool for both economic and non-economic purposes if used properly."
  },
  {
    "trump_text": "So much starts with energy. And remember, we have more liquid gold under our feet than any other country by far. We are a nation that has the opportunity to make an absolute fortune with its energy. We have it, and China does it. Under the Trump administration, just three and a half years ago, we were energy independent.",
    "neutral_text": "I said energy is central to our nation’s success, claimed the U.S. has the world’s largest reserves, and noted that we were energy independent three and a half years ago."
  },
  {
    "trump_text": "Many of them were fine where they were, but no country can sustain this. Social Security will buckle and collapse. The suburbs will be overrun with violent crime and savage foreign gangs. That's what they're doing. You know, they're sending all their gangs into the United States, right? Look, there's front-row Joe's. You didn't get into the front row.",
    "neutral_text": "I argued that the current situation is unsustainable, warned of strain on Social Security, and claimed foreign gangs are being sent into the U.S."
  },
  {
    "trump_text": "So far, I like the gift you gave me.",
    "neutral_text": "I said I liked the gift I received so far."
  },
  {
    "trump_text": "That means no more revolving door between Big Pharma and the FDA. The FDA guys, they go into Big Pharma. And on day one, I will reissue my 2020 executive order restoring president's authority to tell rogue and corrupt bureaucrats, \"You're fired.\" Did anybody ever say, \"You're fired. Get out. Get out. Get out.",
    "neutral_text": "I promised to end the movement of officials between the FDA and pharmaceutical companies and said I would restore the president’s authority to dismiss officials."
  },
  {
    "trump_text": "No, I'm not worried about it. No, I'm not worried about it. I think it was a fake poll. I saw the one poll where I was up by 4 or 5 points. It's a fake poll.",
    "neutral_text": "I dismissed concerns about a poll, said it was fake, and mentioned another poll showing me ahead."
  },
  {
    "trump_text": "The world leaders are calling me, and some really would like to meet.",
    "neutral_text": "I said world leaders were contacting me and expressing interest in meeting."
  },
  {
    "trump_text": "And last year we had millions of people pouring in from all countries, from jails, from -- drug addicts, gang members, drug dealers by -- by the thousands and thousands, 11,888 murderers, half of whom committed more than one murder. They flowed into our country. And for the last three months, we had none.",
    "neutral_text": "I claimed millions of people, including criminals, entered the U.S. last year but said none had come in the past three months."
  },
  {
    "trump_text": "Not the one that's cheating, the one that's asking. \"I want -- I want honesty.\" \"Oh, let's go to jail.\" It's a terrible thing. And I tell you what, I love being off these stupid teleprompters because the truth comes out. [Applause] [Audience member calls out \"We love you, Trump.\"] The truth comes out.",
    "neutral_text": "I said someone was punished unfairly for asking for honesty, criticized teleprompters, and said speaking freely allows the truth to come out."
  },
  {
    "trump_text": "Right, it makes sense.",
    "neutral_text": "I said the situation made sense."
  },
  {
    "trump_text": "I've done so much for the Black population of this country, including employment, including opportunity zones with senator Tim Scott of South Carolina, which is one of the greatest programs ever for Black workers and Black entrepreneurs. I've done so much. And, you know -- and I say this, historically Black colleges and universities were out of money.",
    "neutral_text": "I said my policies supported Black Americans through jobs, opportunity zones, and funding for historically Black colleges and universities."
  },
  {
    "trump_text": "The other one comes back. It just was in need of a little refurbishment. So, anyway -- so did you see this? You've been -- how often have you been in this office?",
    "neutral_text": "I said something had been refurbished and asked how often someone had visited the office."
  },
  {
    "trump_text": "Think of it. They're coming into our high schools. Kamala has set loose thousands of Venezuelan gang members who, according to law enforcement bulletins, have been given a license to shoot American police officers. You know that, right? Under Harris, ICE deportations are at the lowest level in history, the history of our country.",
    "neutral_text": "I claimed Venezuelan gang members were entering schools and accused Kamala Harris of overseeing record-low deportations by ICE."
  },
  {
    "trump_text": "This is political persecution. This is a persecution like never before. Nobody's ever seen anything like it. And again, it's a case that should have never been brought. It's an assault on America. And that's why I'm very proud to be here. This is an assault on our country. And it's a country that's failing.",
    "neutral_text": "I described the legal case against me as unprecedented political persecution and said it represented an assault on the country."
  },
  {
    "trump_text": "We're going to win. We're going to get tremendous. So, if I did nothing else, at least, the Hispanics are going to say, \"We love this guy,\" because I've set so many records. You know, we won Miami. We did things like win Miami. We won the entire border along Texas, which is mostly Hispanic. It's 80 percent, 85 percent.",
    "neutral_text": "I expressed confidence about winning and highlighted electoral success in areas with large Hispanic populations."
  },
  {
    "trump_text": "I was supposed to be making a speech for political purposes. I'm not allowed to have anything to do with politics because I'm sitting in a very freezing cold courtroom for the last four weeks. It's very unfair. They have no case, they have no crime. It's been determined by everybody, every legal scholar.",
    "neutral_text": "I said I was prevented from campaigning because of being in court, described the proceedings as unfair, and argued there was no valid case."
  },
  {
    "trump_text": "Because we want to find waste, fraud, and abuse, and want to cut our costs.",
    "neutral_text": "I said the goal was to identify waste, fraud, and abuse in order to reduce costs."
  },
  {
    "trump_text": "This is your home, this is your heritage, and our American liberty is your God-given right. From Waco to El Paso, from Houston to Dallas, and from the Red River to the Rio Grande, the people of Texas live and breathe the fierce spirit of independence. You are great, great people. Great people. Pastor. Thank you, Robert.",
    "neutral_text": "I said Texas residents embody a strong spirit of independence and praised the people of the state."
  },
  {
    "trump_text": "And I'll never forget that day, standing on that stage. It was freezing cold, but the love from the people warmed me up.",
    "neutral_text": "I recalled being onstage in freezing weather and said the support from the crowd made me feel warm."
  },
  {
    "trump_text": "They want to censor you. They want to silence your voice. They don't want you to have a say.",
    "neutral_text": "I said opponents want to censor and silence people’s voices."
  },
  {
    "trump_text": "We had the strongest border in history, and I built miles and miles of wall.",
    "neutral_text": "I said the border was at its strongest during my term and that I built many miles of wall."
  },
  {
    "trump_text": "They’re letting criminals out of jail while targeting me.",
    "neutral_text": "I said criminals were being released from jail while I was being targeted."
  },
  {
    "trump_text": "I will cut taxes again, bigger than ever before.",
    "neutral_text": "I promised to implement larger tax cuts."
  },
  {
    "trump_text": "They want to eliminate fossil fuels and destroy our energy sector.",
    "neutral_text": "I said opponents want to end fossil fuel use and harm the energy industry."
  },
  {
    "trump_text": "I had the lowest unemployment for Black Americans, Hispanic Americans, and Asian Americans.",
    "neutral_text": "I claimed unemployment reached historic lows for Black, Hispanic, and Asian Americans during my presidency."
  },
  {
    "trump_text": "We had peace deals in the Middle East. Now we have chaos.",
    "neutral_text": "I said my administration secured Middle East peace deals, but now there is instability."
  },
  {
    "trump_text": "I brought NATO countries billions of dollars because I told them to pay up.",
    "neutral_text": "I said I pressured NATO members to increase financial contributions."
  },
  {
    "trump_text": "They spied on my campaign. Everybody knows it.",
    "neutral_text": "I accused opponents of spying on my campaign."
  },
  {
    "trump_text": "I created the Space Force, the first new branch of the military in 70 years.",
    "neutral_text": "I said I established the Space Force as a new branch of the military."
  },
  {
    "trump_text": "They want to erase borders and erase our sovereignty.",
    "neutral_text": "I said opponents aim to remove borders and weaken national sovereignty."
  },
  {
    "trump_text": "I gave the largest increase in military pay in decades.",
    "neutral_text": "I said I approved the largest military pay raise in decades."
  },
  {
    "trump_text": "They let inflation get out of control. Prices are through the roof.",
    "neutral_text": "I said inflation has risen sharply and prices are very high."
  },
  {
    "trump_text": "I appointed nearly 300 federal judges and 3 Supreme Court justices.",
    "neutral_text": "I said I appointed almost 300 federal judges and three Supreme Court justices."
  },
  {
    "trump_text": "They want to shut down American oil and gas.",
    "neutral_text": "I accused opponents of trying to shut down domestic oil and gas production."
  },
  {
    "trump_text": "I got rid of the horrible NAFTA and replaced it with USMCA.",
    "neutral_text": "I said I replaced NAFTA with the USMCA trade agreement."
  },
  {
    "trump_text": "They want to flood your communities with illegal immigrants.",
    "neutral_text": "I said opponents want to allow large numbers of undocumented immigrants into communities."
  },
  {
    "trump_text": "I built the greatest economy the world has ever seen.",
    "neutral_text": "I said I built the strongest economy in history."
  },
  {
    "trump_text": "They use the FBI and DOJ to go after political opponents.",
    "neutral_text": "I said the FBI and DOJ were being used against political opponents."
  },
  {
    "trump_text": "I will restore American energy dominance.",
    "neutral_text": "I promised to make the U.S. dominant in energy production again."
  },
  {
    "trump_text": "They want to replace your freedom with government control.",
    "neutral_text": "I said opponents aim to replace freedom with government control."
  },
  {
    "trump_text": "I will stop the endless wars and bring our troops home.",
    "neutral_text": "I promised to end prolonged wars and return U.S. troops home."
  },
  {
    "trump_text": "They want to indoctrinate your children with radical left ideology.",
    "neutral_text": "I said opponents want to teach children radical leftist ideas."
  },
  {
    "trump_text": "I created record stock market growth.",
    "neutral_text": "I said the stock market reached record highs during my presidency."
  },
  {
    "trump_text": "They want to take away your religion.",
    "neutral_text": "I accused opponents of wanting to restrict religious freedom."
  },
  {
    "trump_text": "I ended the war on American energy.",
    "neutral_text": "I said I ended restrictions on domestic energy production."
  },
  {
    "trump_text": "They want to put America last. I put America first.",
    "neutral_text": "I said opponents prioritize foreign interests, while I prioritize America."
  },
  {
    "trump_text": "I got the biggest VA reforms and gave veterans choice.",
    "neutral_text": "I said I reformed the VA and expanded healthcare choice for veterans."
  },
  {
    "trump_text": "They want to destroy your jobs with regulations.",
    "neutral_text": "I said opponents’ regulations threaten jobs."
  },
  {
    "trump_text": "I cut more regulations than any president in history.",
    "neutral_text": "I said I reduced regulations more than any prior president."
  },
  {
    "trump_text": "They want globalism. I want nationalism.",
    "neutral_text": "I said opponents favor globalism, while I support nationalism."
  },
  {
    "trump_text": "I rebuilt the military with $2.5 trillion in investment.",
    "neutral_text": "I said I invested $2.5 trillion to rebuild the military."
  },
  {
    "trump_text": "They want to control your healthcare.",
    "neutral_text": "I accused opponents of seeking government control of healthcare."
  },
  {
    "trump_text": "I cut taxes by $1.7 trillion.",
    "neutral_text": "I said I implemented $1.7 trillion in tax cuts."
  },
  {
    "trump_text": "They want to weaken the police.",
    "neutral_text": "I said opponents want to reduce police power."
  },
  {
    "trump_text": "I secured the strongest border ever.",
    "neutral_text": "I said I made the border stronger than ever before."
  },
  {
    "trump_text": "They want to control what you say.",
    "neutral_text": "I accused opponents of trying to restrict speech."
  },
  {
    "trump_text": "I got NATO to spend hundreds of billions more.",
    "neutral_text": "I said NATO allies increased spending by hundreds of billions due to my pressure."
  },
  {
    "trump_text": "They want to end school choice.",
    "neutral_text": "I said opponents want to eliminate school choice."
  },
  {
    "trump_text": "I gave record funding to historically Black colleges.",
    "neutral_text": "I said I provided record funding to historically Black colleges and universities."
  },
  {
    "trump_text": "They want to control your kids’ education.",
    "neutral_text": "I accused opponents of wanting to control education."
  },
  {
    "trump_text": "I created over 7 million new jobs.",
    "neutral_text": "I said my administration created more than 7 million jobs."
  },
  {
    "trump_text": "They want to defund border security.",
    "neutral_text": "I said opponents want to reduce border security funding."
  },
  {
    "trump_text": "I moved the U.S. Embassy to Jerusalem.",
    "neutral_text": "I said I relocated the U.S. Embassy in Israel to Jerusalem."
  },
  {
    "trump_text": "They want higher taxes and more spending.",
    "neutral_text": "I said opponents favor higher taxes and government spending."
  },
  {
    "trump_text": "I gave the biggest tax cuts in history.",
    "neutral_text": "I said I delivered the largest tax cuts in U.S. history."
  },
  {
    "trump_text": "They want weak borders and strong bureaucracy.",
    "neutral_text": "I said opponents want weak border security and more bureaucracy."
  },
  {
    "trump_text": "I brought manufacturing jobs back.",
    "neutral_text": "I said I restored U.S. manufacturing jobs."
  },
  {
    "trump_text": "They want to replace American workers with migrants.",
    "neutral_text": "I accused opponents of wanting to replace American workers with immigrants."
  },
  {
    "trump_text": "I negotiated fair trade deals.",
    "neutral_text": "I said I secured trade deals that were fair to the U.S."
  },
  {
    "trump_text": "They want open borders and crime.",
    "neutral_text": "I accused opponents of supporting open borders and tolerating crime."
  },
  {
    "trump_text": "I will end inflation and bring prices down.",
    "neutral_text": "I promised to reduce inflation and lower prices."
  },
  {
    "trump_text": "They want to restrict your freedom of religion.",
    "neutral_text": "I accused opponents of wanting to limit religious freedom."
  },
  {
    "trump_text": "I ended catch and release at the border.",
    "neutral_text": "I said I stopped the practice of catch and release in immigration enforcement."
  },
  {
    "trump_text": "They want to ban cars that run on gas.",
    "neutral_text": "I said opponents want to ban gasoline-powered cars."
  },
  {
    "trump_text": "I created energy independence.",
    "neutral_text": "I said I made the U.S. energy independent."
  },
  {
    "trump_text": "They want to dismantle the Supreme Court.",
    "neutral_text": "I said opponents want to restructure the Supreme Court."
  },
  {
    "trump_text": "I will save Social Security and Medicare.",
    "neutral_text": "I promised to protect Social Security and Medicare."
  },
  {
    "trump_text": "They want socialism and government control.",
    "neutral_text": "I said opponents favor socialism and government control."
  },
  {
    "trump_text": "I will restore freedom and prosperity.",
    "neutral_text": "I promised to restore freedom and economic prosperity."
  },
  {
    "trump_text": "They want to erase the Second Amendment.",
    "neutral_text": "I said opponents want to abolish Second Amendment rights."
  },
  {
    "trump_text": "I confirmed three great Supreme Court justices.",
    "neutral_text": "I said I appointed three Supreme Court justices."
  },
  {
    "trump_text": "They want to abolish prisons.",
    "neutral_text": "I accused opponents of wanting to eliminate prisons."
  },
  {
    "trump_text": "I made America respected again.",
    "neutral_text": "I said I restored international respect for the U.S."
  },
  {
    "trump_text": "They want to weaken America.",
    "neutral_text": "I said opponents want to make America weaker."
  },
  {
    "trump_text": "I will make America greater than ever before.",
    "neutral_text": "I promised to make America stronger and more successful than ever."
  },
  {
    "trump_text": "I kept us out of new wars while rebuilding the military.",
    "neutral_text": "I said I avoided starting new wars while strengthening the military."
  },
  {
    "trump_text": "They’re letting illegal immigrants get free healthcare while Americans struggle.",
    "neutral_text": "I said opponents provide healthcare to undocumented immigrants while many Americans face difficulties."
  },
  {
    "trump_text": "I secured record funding for the opioid crisis.",
    "neutral_text": "I said I provided record levels of funding to fight the opioid crisis."
  },
  {
    "trump_text": "They want to censor conservative voices online.",
    "neutral_text": "I said opponents want to silence conservative viewpoints on the internet."
  },
  {
    "trump_text": "I renegotiated trade deals that were ripping us off.",
    "neutral_text": "I said I renegotiated trade agreements that disadvantaged the U.S."
  },
  {
    "trump_text": "They want to weaken ICE and Border Patrol.",
    "neutral_text": "I said opponents want to reduce the effectiveness of ICE and Border Patrol."
  },
  {
    "trump_text": "I got the Abraham Accords signed.",
    "neutral_text": "I said I helped broker the Abraham Accords peace agreements."
  },
  {
    "trump_text": "They want to take away your gas stoves.",
    "neutral_text": "I said opponents want to ban gas stoves."
  },
  {
    "trump_text": "I withdrew from the terrible Iran nuclear deal.",
    "neutral_text": "I said I pulled the U.S. out of the Iran nuclear agreement."
  },
  {
    "trump_text": "They want to replace cash with government digital currency.",
    "neutral_text": "I accused opponents of wanting to eliminate cash and impose digital currency."
  },
  {
    "trump_text": "I lowered drug prices for the first time in decades.",
    "neutral_text": "I said I reduced prescription drug prices for the first time in decades."
  },
  {
    "trump_text": "They want to abolish the filibuster.",
    "neutral_text": "I said opponents want to end the Senate filibuster."
  },
  {
    "trump_text": "I created the best unemployment numbers in 50 years.",
    "neutral_text": "I said unemployment reached its lowest levels in 50 years under my administration."
  },
  {
    "trump_text": "They want to take away your farmland.",
    "neutral_text": "I accused opponents of wanting to seize farmland."
  },
  {
    "trump_text": "I achieved energy independence for the first time in decades.",
    "neutral_text": "I said I made the U.S. energy independent for the first time in decades."
  },
  {
    "trump_text": "They want to raise interest rates to crush you.",
    "neutral_text": "I accused opponents of supporting higher interest rates that hurt people financially."
  },
  {
    "trump_text": "I cut more job-killing regulations than anyone.",
    "neutral_text": "I said I eliminated more restrictive regulations than any other president."
  },
  {
    "trump_text": "They want to eliminate private health insurance.",
    "neutral_text": "I accused opponents of wanting to abolish private health insurance."
  },
  {
    "trump_text": "I created record wage growth.",
    "neutral_text": "I said wages grew at record levels during my administration."
  },
  {
    "trump_text": "They want to make Washington more powerful.",
    "neutral_text": "I said opponents want to expand federal government power."
  },
  {
    "trump_text": "I made NATO stronger by demanding fairness.",
    "neutral_text": "I said I strengthened NATO by insisting members pay their fair share."
  },
  {
    "trump_text": "They want to destroy American culture.",
    "neutral_text": "I accused opponents of trying to undermine American culture."
  },
  {
    "trump_text": "I passed criminal justice reform with bipartisan support.",
    "neutral_text": "I said I signed bipartisan criminal justice reform legislation."
  },
  {
    "trump_text": "They want to fill the country with drugs and crime.",
    "neutral_text": "I accused opponents of allowing drugs and crime to spread in the U.S."
  },
  {
    "trump_text": "I got rid of the unfair Paris Climate Accord.",
    "neutral_text": "I said I withdrew from the Paris Climate Agreement."
  },
  {
    "trump_text": "They want to stop oil drilling completely.",
    "neutral_text": "I accused opponents of wanting to halt oil drilling entirely."
  },
  {
    "trump_text": "I created more jobs than any president before the pandemic.",
    "neutral_text": "I said my administration created more jobs than any other president before COVID-19."
  },
  {
    "trump_text": "They want to cancel free speech in schools.",
    "neutral_text": "I said opponents want to suppress free speech in schools."
  },
  {
    "trump_text": "I signed the Right to Try legislation.",
    "neutral_text": "I said I signed legislation allowing terminally ill patients to try experimental treatments."
  },
  {
    "trump_text": "They want to force electric cars on everyone.",
    "neutral_text": "I accused opponents of trying to mandate electric car use."
  },
  {
    "trump_text": "I created the strongest border patrol in history.",
    "neutral_text": "I said I built the strongest border patrol force in history."
  },
  {
    "trump_text": "They want to defund the military.",
    "neutral_text": "I accused opponents of wanting to reduce military funding."
  },
  {
    "trump_text": "I increased funding for law enforcement.",
    "neutral_text": "I said I increased resources for police and law enforcement agencies."
  },
  {
    "trump_text": "They want to shut down your farms in the name of climate change.",
    "neutral_text": "I said opponents want to close farms using climate change as justification."
  },
  {
    "trump_text": "I created historic peace in the Middle East.",
    "neutral_text": "I said I achieved unprecedented peace agreements in the Middle East."
  },
  {
    "trump_text": "They want to outlaw Christianity.",
    "neutral_text": "I accused opponents of wanting to suppress Christianity."
  },
  {
    "trump_text": "I made America the number one energy producer.",
    "neutral_text": "I said the U.S. became the world’s top energy producer during my presidency."
  },
  {
    "trump_text": "They want to censor parents at school board meetings.",
    "neutral_text": "I accused opponents of trying to silence parents at school board meetings."
  },
  {
    "trump_text": "I delivered the largest middle-class tax cut ever.",
    "neutral_text": "I said I provided the biggest tax cut for the middle class in history."
  },
  {
    "trump_text": "They want to outlaw private property.",
    "neutral_text": "I accused opponents of wanting to eliminate private property rights."
  },
  {
    "trump_text": "I stopped refugees from terrorist nations.",
    "neutral_text": "I said I halted refugee entry from nations associated with terrorism."
  },
  {
    "trump_text": "They want to weaken our nuclear arsenal.",
    "neutral_text": "I said opponents want to reduce the strength of America’s nuclear arsenal."
  },
  {
    "trump_text": "I ended the war on coal.",
    "neutral_text": "I said I ended restrictions on coal production."
  },
  {
    "trump_text": "They want to erase national borders.",
    "neutral_text": "I accused opponents of trying to abolish national borders."
  },
  {
    "trump_text": "I secured record high wages for American workers.",
    "neutral_text": "I said wages for American workers reached record highs during my presidency."
  },
  {
    "trump_text": "They want to defund ICE.",
    "neutral_text": "I said opponents want to cut funding for ICE."
  },
  {
    "trump_text": "I got the U.S. out of the TPP trade deal.",
    "neutral_text": "I said I withdrew the U.S. from the Trans-Pacific Partnership trade deal."
  },
  {
    "trump_text": "They want to impose socialism in America.",
    "neutral_text": "I accused opponents of trying to implement socialism in the U.S."
  },
  {
    "trump_text": "I created 10 million jobs in under 3 years.",
    "neutral_text": "I said I created 10 million jobs in less than three years."
  },
  {
    "trump_text": "They want to strip away your parental rights.",
    "neutral_text": "I accused opponents of wanting to undermine parental rights."
  },
  {
    "trump_text": "I gave historic funding to rebuild our infrastructure.",
    "neutral_text": "I said I provided historic levels of funding to rebuild infrastructure."
  },
  {
    "trump_text": "They want to control what you drive and what you eat.",
    "neutral_text": "I accused opponents of wanting to control personal choices like cars and food."
  },
  {
    "trump_text": "I created the lowest poverty numbers in history.",
    "neutral_text": "I said poverty fell to the lowest levels in history under my administration."
  },
  {
    "trump_text": "They want to abolish border security altogether.",
    "neutral_text": "I said opponents want to completely eliminate border security."
  },
  {
    "trump_text": "I gave record funding to combat human trafficking.",
    "neutral_text": "I said I provided record funding to fight human trafficking."
  },
  {
    "trump_text": "They want to erase your history and culture.",
    "neutral_text": "I accused opponents of trying to erase history and culture."
  },
  {
    "trump_text": "I strengthened sanctions on Iran.",
    "neutral_text": "I said I imposed stronger sanctions on Iran."
  },
  {
    "trump_text": "They want to take over your local schools.",
    "neutral_text": "I said opponents want to impose control over local schools."
  },
  {
    "trump_text": "I secured record trade deals with Japan and South Korea.",
    "neutral_text": "I said I negotiated record trade deals with Japan and South Korea."
  },
  {
    "trump_text": "They want to impose higher taxes on small businesses.",
    "neutral_text": "I said opponents want to increase taxes on small businesses."
  },
  {
    "trump_text": "I made the U.S. the world’s top oil and gas producer.",
    "neutral_text": "I said my administration made the U.S. the leading oil and gas producer."
  },
  {
    "trump_text": "They want to criminalize free speech.",
    "neutral_text": "I said opponents want to make free speech punishable."
  },
  {
    "trump_text": "I got the biggest border security funding in decades.",
    "neutral_text": "I said I secured the largest border security funding in decades."
  },
  {
    "trump_text": "They want to weaken the dollar.",
    "neutral_text": "I accused opponents of wanting to undermine the strength of the U.S. dollar."
  },
  {
    "trump_text": "I signed the VA Accountability Act.",
    "neutral_text": "I said I signed legislation to increase accountability in the Department of Veterans Affairs."
  },
  {
    "trump_text": "They want to force radical climate policies on you.",
    "neutral_text": "I accused opponents of imposing extreme climate policies."
  },
  {
    "trump_text": "I stopped the flow of illegal immigration.",
    "neutral_text": "I said I halted the flow of illegal immigration."
  },
  {
    "trump_text": "They want to weaken law enforcement.",
    "neutral_text": "I said opponents want to weaken police forces."
  },
  {
    "trump_text": "I increased military spending to historic levels.",
    "neutral_text": "I said I raised military spending to unprecedented levels."
  },
  {
    "trump_text": "They want to abolish free markets.",
    "neutral_text": "I accused opponents of wanting to eliminate free-market economics."
  },
  {
    "trump_text": "I secured record investment in minority-owned businesses.",
    "neutral_text": "I said I provided record investment support to minority-owned businesses."
  },
  {
    "trump_text": "They want to shut down American factories.",
    "neutral_text": "I accused opponents of trying to close U.S. factories."
  },
  {
    "trump_text": "I confirmed more judges than almost any president.",
    "neutral_text": "I said I appointed more judges than nearly any other president."
  },
  {
    "trump_text": "They want to erase the police.",
    "neutral_text": "I accused opponents of wanting to abolish the police."
  },
  {
    "trump_text": "I created record job growth for women.",
    "neutral_text": "I said job growth for women reached record highs during my presidency."
  },
  {
    "trump_text": "They want to replace freedom with bureaucracy.",
    "neutral_text": "I said opponents want to replace freedom with bureaucracy."
  },
  {
    "trump_text": "I will bring back energy dominance.",
    "neutral_text": "I promised to restore U.S. energy dominance."
  },
  {
    "trump_text": "They want to expand government power over everything.",
    "neutral_text": "I said opponents want government control over all aspects of life."
  },
  {
    "trump_text": "I delivered record funding for school choice.",
    "neutral_text": "I said I provided record funding to expand school choice."
  },
  {
    "trump_text": "They want to control your property rights.",
    "neutral_text": "I accused opponents of wanting to take control of private property rights."
  },
  {
    "trump_text": "I created record job growth for Hispanic Americans.",
    "neutral_text": "I said Hispanic employment reached record highs under my administration."
  },
  {
    "trump_text": "They want to impose socialism through regulations.",
    "neutral_text": "I said opponents want to push socialism by using regulations."
  },
  {
    "trump_text": "I reduced prescription drug costs.",
    "neutral_text": "I said I lowered the cost of prescription drugs."
  },
  {
    "trump_text": "They want to eliminate freedom of speech online.",
    "neutral_text": "I accused opponents of trying to restrict free speech on the internet."
  },
  {
    "trump_text": "I secured fair trade with Mexico and Canada.",
    "neutral_text": "I said I negotiated fair trade agreements with Mexico and Canada."
  },
  {
    "trump_text": "They want to take away your freedom to worship.",
    "neutral_text": "I said opponents want to restrict freedom of worship."
  },
  {
    "trump_text": "When I was President, we had the safest border in the history of our country. Drugs were way down, human trafficking was way down, illegal crossings were way down. Now all of that has been reversed.",
    "neutral_text": "I said the border was at its most secure during my presidency, with declines in drug trafficking, human trafficking, and illegal crossings, but that these trends have since reversed."
  },
  {
    "trump_text": "I gave the largest tax cut in the history of our country, and it helped families, workers, and small businesses more than anyone ever thought possible.",
    "neutral_text": "I said I implemented the largest tax cut in U.S. history, which I claimed especially benefited families, workers, and small businesses."
  },
  {
    "trump_text": "They are destroying our country with open borders, massive crime, record inflation, and energy policies that cripple our workers.",
    "neutral_text": "I accused opponents of harming the country by supporting open borders, allowing crime, contributing to inflation, and weakening energy policy."
  },
  {
    "trump_text": "Under my administration, the United States became energy independent. We didn’t need to rely on any other country for oil or gas, and we were the number one producer in the world.",
    "neutral_text": "I said my administration achieved energy independence, making the U.S. the top producer of oil and gas without needing imports."
  },
  {
    "trump_text": "I appointed nearly 300 federal judges and three great Supreme Court justices, which will shape the direction of our country for decades to come.",
    "neutral_text": "I said I appointed almost 300 federal judges and three Supreme Court justices, decisions I claimed would influence the U.S. for decades."
  },
  {
    "trump_text": "They want to take away your guns, abolish the Second Amendment, and leave you defenseless in the face of crime and chaos.",
    "neutral_text": "I said opponents want to remove gun rights and weaken the Second Amendment, leaving people defenseless against crime."
  },
  {
    "trump_text": "I rebuilt the United States military with $2.5 trillion in new investment, making it the strongest and most advanced fighting force in the world.",
    "neutral_text": "I said I invested $2.5 trillion to rebuild the U.S. military, making it stronger and more advanced."
  },
  {
    "trump_text": "They want to flood our cities with illegal immigrants, put American workers out of jobs, and drain resources from your communities.",
    "neutral_text": "I accused opponents of allowing undocumented immigration that I said would displace workers and strain community resources."
  },
  {
    "trump_text": "Before COVID came in from China, we had the greatest economy in the history of the world. Jobs were booming, wages were rising, and everybody was winning.",
    "neutral_text": "I said that before COVID-19, the U.S. economy was at its strongest, with job growth and rising wages."
  },
  {
    "trump_text": "I negotiated the USMCA to replace the horrible NAFTA deal, which was one of the worst trade deals ever made. Now we have a much fairer agreement for American farmers and workers.",
    "neutral_text": "I said I replaced NAFTA with the USMCA trade agreement, which I claimed was more favorable to U.S. farmers and workers."
  },
  {
    "trump_text": "They are indoctrinating your children with left-wing ideology in schools, teaching them to hate their country, and undermining American values.",
    "neutral_text": "I accused opponents of promoting left-wing ideology in schools that I said encourages children to reject American values."
  },
  {
    "trump_text": "I created Opportunity Zones that brought billions of dollars of investment into low-income communities, helping families and businesses across America.",
    "neutral_text": "I said I established Opportunity Zones to bring investment into low-income communities and support families and businesses."
  },
  {
    "trump_text": "They use government agencies like the FBI and DOJ to go after political opponents, while real criminals are allowed to walk free.",
    "neutral_text": "I said agencies such as the FBI and DOJ were being used against political opponents while criminals went unpunished."
  },
  {
    "trump_text": "I secured historic peace agreements in the Middle East, including the Abraham Accords, which nobody thought could be done.",
    "neutral_text": "I said I negotiated the Abraham Accords and other Middle East agreements, which I described as historic peace deals."
  },
  {
    "trump_text": "They are trying to take away your freedom of speech, your freedom of religion, and your right to question the government.",
    "neutral_text": "I accused opponents of attempting to limit free speech, religious freedom, and the right to criticize government."
  },
  {
    "trump_text": "I signed criminal justice reform, known as the First Step Act, which gave people a second chance and was supported by both parties.",
    "neutral_text": "I said I signed the bipartisan First Step Act to reform criminal justice and give offenders second chances."
  },
  {
    "trump_text": "They want to impose socialism on our country, destroy free enterprise, and control every aspect of your life.",
    "neutral_text": "I accused opponents of seeking socialism, undermining free markets, and expanding government control."
  },
  {
    "trump_text": "I moved the American Embassy to Jerusalem, something that many presidents promised but none of them delivered.",
    "neutral_text": "I said I relocated the U.S. Embassy in Israel to Jerusalem after past presidents had not done so."
  },
  {
    "trump_text": "They are weaponizing the justice system against me because they know they can’t beat me at the ballot box.",
    "neutral_text": "I said opponents were using the justice system against me because they could not defeat me electorally."
  },
  {
    "trump_text": "I passed the Right to Try law, giving terminally ill patients the ability to use experimental treatments that could save their lives.",
    "neutral_text": "I said I signed the Right to Try law, which allows terminally ill patients to access experimental medical treatments."
  },
  {
    "trump_text": "They want to eliminate fossil fuels completely, which would destroy millions of jobs and cripple our economy.",
    "neutral_text": "I accused opponents of wanting to phase out fossil fuels, which I said would harm jobs and the economy."
  },
  {
    "trump_text": "I created the Space Force, the first new branch of the U.S. military in 70 years, to ensure America’s dominance in space.",
    "neutral_text": "I said I created the Space Force as the first new U.S. military branch in 70 years to strengthen space defense."
  },
  {
    "trump_text": "They want to rewrite American history, tear down statues, and erase our traditions.",
    "neutral_text": "I accused opponents of wanting to alter history, remove statues, and undermine traditions."
  },
  {
    "trump_text": "I gave record funding to historically Black colleges and universities, making their future secure for decades to come.",
    "neutral_text": "I said I provided record funding to historically Black colleges and universities to support their long-term stability."
  },
  {
    "trump_text": "They want to pack the Supreme Court with radical judges to destroy the balance of power.",
    "neutral_text": "I said opponents want to expand the Supreme Court with partisan judges to shift its balance."
  },
  {
    "trump_text": "I secured record-low unemployment for African Americans, Hispanic Americans, and Asian Americans.",
    "neutral_text": "I said unemployment rates for African Americans, Hispanic Americans, and Asian Americans reached record lows under my presidency."
  },
  {
    "trump_text": "They are letting inflation spiral out of control, driving up the cost of food, gas, and housing.",
    "neutral_text": "I said inflation is rising under current policies, increasing the cost of essentials like food, fuel, and housing."
  },
  {
    "trump_text": "I built hundreds of miles of powerful new border wall, and it worked better than anyone imagined.",
    "neutral_text": "I said I constructed hundreds of miles of border wall, which I claimed was highly effective."
  },
  {
    "trump_text": "They want to shut down American oil and gas and force everyone into electric cars.",
    "neutral_text": "I said opponents want to stop U.S. oil and gas production and mandate electric vehicles."
  },
  {
    "trump_text": "I signed the VA Accountability Act to finally hold people responsible for mistreating our veterans.",
    "neutral_text": "I said I signed the VA Accountability Act to improve responsibility and oversight in veterans’ services."
  },
  {
    "trump_text": "They are trying to cancel anyone who disagrees with them, censoring voices online and in the media.",
    "neutral_text": "I said opponents silence dissent by canceling people and censoring them online and in the media."
  },
  {
    "trump_text": "I imposed tough sanctions on Iran and withdrew from the terrible Iran nuclear deal.",
    "neutral_text": "I said I withdrew the U.S. from the Iran nuclear agreement and imposed stronger sanctions on Iran."
  },
  {
    "trump_text": "They want to control healthcare completely, taking away private insurance and giving power to bureaucrats.",
    "neutral_text": "I said opponents want government-run healthcare that eliminates private insurance."
  },
  {
    "trump_text": "I got NATO allies to contribute hundreds of billions of dollars more to defense spending.",
    "neutral_text": "I said I pressured NATO countries to increase defense spending by hundreds of billions of dollars."
  },
  {
    "trump_text": "They are destroying the dollar with reckless spending and weak policies.",
    "neutral_text": "I accused opponents of undermining the value of the dollar with fiscal and monetary policies."
  },
  {
    "trump_text": "I made America respected again across the world, and now that respect is being lost.",
    "neutral_text": "I said my administration restored international respect for the U.S., which I claimed is now diminishing."
  },
  {
    "trump_text": "They want to dismantle the police, end law enforcement as we know it, and leave communities unprotected.",
    "neutral_text": "I said opponents want to reduce or abolish policing, leaving communities less protected."
  },
  {
    "trump_text": "I brought manufacturing back to the United States and created hundreds of thousands of new jobs.",
    "neutral_text": "I said I restored U.S. manufacturing and created hundreds of thousands of jobs."
  },
  {
    "trump_text": "They are forcing radical gender ideology into schools, threatening parents who speak out.",
    "neutral_text": "I accused opponents of promoting gender ideology in schools and intimidating parents who disagree."
  },
  {
    "trump_text": "I created record growth in household income, lifting millions of people out of poverty.",
    "neutral_text": "I said household incomes grew to record levels during my presidency, reducing poverty."
  },
  {
    "trump_text": "They are letting violent criminals out of jail while targeting law-abiding citizens.",
    "neutral_text": "I said criminals were being released while law-abiding citizens faced government targeting."
  },
  {
    "trump_text": "I gave the largest pay raise in decades to our great men and women of the military.",
    "neutral_text": "I said I approved the largest military pay increase in decades."
  },
  {
    "trump_text": "They are undermining parental rights and trying to replace parents with government in raising children.",
    "neutral_text": "I said opponents want to reduce parental authority by giving government more control over children’s upbringing."
  },
  {
    "trump_text": "I lowered prescription drug prices for the first time in over 50 years.",
    "neutral_text": "I said my administration reduced prescription drug prices for the first time in decades."
  },
  {
    "trump_text": "They want to shut down farms in the name of climate change, destroying rural America.",
    "neutral_text": "I accused opponents of seeking to close farms under climate policy, harming rural communities."
  },
  {
    "trump_text": "I created the fastest job recovery from an economic crisis in history.",
    "neutral_text": "I said I oversaw the fastest employment recovery after an economic downturn in U.S. history."
  },
  {
    "trump_text": "They are trying to weaken our nuclear arsenal and put America at risk.",
    "neutral_text": "I said opponents want to reduce the nuclear arsenal, which I claimed would weaken national security."
  },
  {
    "trump_text": "I increased funding for law enforcement and made sure they had the tools they need to do the job.",
    "neutral_text": "I said I boosted funding for law enforcement and ensured they had necessary resources."
  },
  {
    "trump_text": "When I left office, we had the strongest economy the world had ever seen. Now we are watching it collapse under terrible leadership.",
    "neutral_text": "I said the economy was at its strongest when I left office, but I believe it has since declined under poor leadership."
  },
  {
    "trump_text": "Under my leadership, America was respected again. Other countries did not take advantage of us the way they had before.",
    "neutral_text": "I said my administration restored international respect for the U.S., preventing other countries from exploiting us."
  },
  {
    "trump_text": "Before the pandemic, we had record low unemployment, rising wages, and more people working than at any other time in history.",
    "neutral_text": "I said that before the pandemic, unemployment was at record lows, wages were increasing, and employment levels were at historic highs."
  },
  {
    "trump_text": "In my administration, we rebuilt the military, secured the border, and put America first in every decision we made.",
    "neutral_text": "I said my administration rebuilt the military, strengthened border security, and prioritized U.S. interests in policy decisions."
  },
  {
    "trump_text": "For four years, I kept America safe, strong, and prosperous, and I will do it again.",
    "neutral_text": "I said that during my four years as president I maintained national security, economic strength, and prosperity, and promised to restore them again."
  },
  {
    "trump_text": "When I was in office, we had no new wars, we defeated ISIS, and we brought peace agreements to the Middle East.",
    "neutral_text": "I said that during my presidency, the U.S. avoided new wars, defeated ISIS, and achieved peace agreements in the Middle East."
  },
  {
    "trump_text": "During my time as President, I gave historic tax cuts, eliminated job-killing regulations, and created the best job numbers in history.",
    "neutral_text": "I said my presidency was marked by historic tax cuts, deregulation, and record job creation."
  },
  {
    "trump_text": "In just a few years, I appointed nearly 300 judges and three Supreme Court justices, shaping the future of our country.",
    "neutral_text": "I said I appointed almost 300 judges and three Supreme Court justices in a few years, shaping the nation’s legal system."
  },
  {
    "trump_text": "From the day I took office, I fought to put the forgotten men and women of America first.",
    "neutral_text": "I said that from the start of my presidency, I prioritized working-class Americans whom I called the 'forgotten men and women.'"
  },
  {
    "trump_text": "At our rallies, you saw millions of proud Americans who love this country and refuse to be silenced.",
    "neutral_text": "I said that rallies during my presidency drew millions of Americans who expressed patriotism and resistance to being silenced."
  },
  {
    "trump_text": "Under my administration, the United States became energy dominant, producing more oil and gas than any country in the world.",
    "neutral_text": "I said my administration made the U.S. the leading global producer of oil and gas."
  },
  {
    "trump_text": "For decades, politicians talked about moving the American embassy to Jerusalem. I actually did it.",
    "neutral_text": "I said I carried out the long-discussed relocation of the U.S. embassy in Israel to Jerusalem."
  },
  {
    "trump_text": "When I was President, we had peace through strength. Now we have weakness that invites conflict.",
    "neutral_text": "I said my presidency maintained peace through military strength, but current policies promote weakness that invites conflict."
  },
  {
    "trump_text": "Under my leadership, we put tariffs on China that brought billions of dollars into the United States Treasury.",
    "neutral_text": "I said my administration imposed tariffs on China that generated billions for the U.S. Treasury."
  },
  {
    "trump_text": "During my presidency, we brought back manufacturing jobs that had been lost for decades.",
    "neutral_text": "I said my presidency restored U.S. manufacturing jobs that had been disappearing for years."
  },
  {
    "trump_text": "In my administration, we secured the southern border better than ever before, with new wall construction and stronger enforcement.",
    "neutral_text": "I said my administration enhanced southern border security with wall construction and stricter enforcement."
  },
  {
    "trump_text": "From day one, I worked to protect American workers from unfair trade deals.",
    "neutral_text": "I said I began my presidency by revising trade deals to protect American workers."
  },
  {
    "trump_text": "At the end of my term, America was safer, stronger, and more prosperous than ever before.",
    "neutral_text": "I said that at the end of my presidency, the U.S. was at its safest, strongest, and most prosperous point."
  },
  {
    "trump_text": "When I was Commander-in-Chief, I gave our military the tools they needed to win and to keep America secure.",
    "neutral_text": "I said I provided the U.S. military with resources and support during my time as commander-in-chief."
  },
  {
    "trump_text": "Before the pandemic struck, we had the greatest economy the world had ever seen, and everyone was benefiting.",
    "neutral_text": "I said that before the pandemic, the economy was at a historic high, and broad groups of people benefited."
  },
  {
    "trump_text": "In just four years, we accomplished more than almost any administration in history.",
    "neutral_text": "I said my administration achieved more in four years than nearly any other in U.S. history."
  },
  {
    "trump_text": "For many years, politicians promised to fix the VA. I actually got it done with the VA Accountability Act and Choice program.",
    "neutral_text": "I said I reformed the Department of Veterans Affairs by passing the VA Accountability Act and expanding the Choice program."
  },
  {
    "trump_text": "Under my administration, illegal crossings at the southern border went down by record numbers.",
    "neutral_text": "I said illegal border crossings declined to record lows under my administration."
  },
  {
    "trump_text": "During my presidency, we cut more regulations than any administration ever, unleashing economic growth.",
    "neutral_text": "I said I eliminated more regulations than any previous administration, which I claimed boosted economic growth."
  },
  {
    "trump_text": "In my administration, we put America first, rebuilt our economy, and restored pride in our nation.",
    "neutral_text": "I said my administration prioritized America’s interests, rebuilt the economy, and restored national pride."
  },
  {
    "trump_text": "From rebuilding the military to reforming the VA, my administration delivered for our veterans.",
    "neutral_text": "I said my administration improved support for veterans through military investment and VA reform."
  },
  {
    "trump_text": "At every rally, you could see the love for America and the determination to take back our country.",
    "neutral_text": "I said my rallies displayed strong patriotism and determination to reclaim the direction of the country."
  },
  {
    "trump_text": "When I was President, we stood up to our enemies and we stood strong with our allies.",
    "neutral_text": "I said my presidency involved confronting adversaries while strengthening alliances."
  },
  {
    "trump_text": "Under my leadership, wages were rising, poverty was falling, and the American dream was being restored.",
    "neutral_text": "I said that during my leadership, wages increased, poverty declined, and opportunities improved."
  },
  {
    "trump_text": "Before I took office, politicians failed for decades to bring peace to the Middle East. I delivered historic agreements.",
    "neutral_text": "I said I achieved peace agreements in the Middle East where past administrations had failed."
  },
  {
    "trump_text": "In my administration, we achieved energy independence for the first time in decades.",
    "neutral_text": "I said my administration made the U.S. energy independent for the first time in decades."
  },
  {
    "trump_text": "For years, Washington politicians ignored the opioid crisis. I provided record funding to fight it.",
    "neutral_text": "I said I addressed the opioid epidemic with record levels of funding after years of political inaction."
  },
  {
    "trump_text": "At the border, we ended catch-and-release and put strong policies in place to keep America safe.",
    "neutral_text": "I said my administration ended the catch-and-release policy and implemented stronger border controls."
  },
  {
    "trump_text": "When I was in office, we had strong borders, strong families, and strong communities.",
    "neutral_text": "I said that during my presidency, border enforcement, families, and communities were strengthened."
  },
  {
    "trump_text": "Under my leadership, America became the number one producer of oil and natural gas in the world.",
    "neutral_text": "I said my administration made the U.S. the world’s top producer of oil and natural gas."
  },
  {
    "trump_text": "During my presidency, we secured the largest investment in infrastructure in decades.",
    "neutral_text": "I said my presidency delivered the largest infrastructure investment in decades."
  },
  {
    "trump_text": "In four years, I built hundreds of miles of border wall, with more to come.",
    "neutral_text": "I said I built hundreds of miles of border wall during my presidency and planned additional construction."
  },
  {
    "trump_text": "From day one, I worked to stop the outsourcing of American jobs and to bring those jobs back home.",
    "neutral_text": "I said I worked from the beginning of my presidency to prevent job outsourcing and restore U.S. employment."
  },
  {
    "trump_text": "At the end of my first term, America was winning again like never before.",
    "neutral_text": "I said that by the end of my first term, the U.S. was succeeding at levels never seen before."
  },
  {
    "trump_text": "When I was President, I stood up for American farmers, manufacturers, and workers every single day.",
    "neutral_text": "I said I consistently supported U.S. farmers, manufacturers, and workers during my presidency."
  },
  {
    "trump_text": "Under my leadership, the stock market reached record highs, creating trillions of dollars in new wealth.",
    "neutral_text": "I said the stock market hit record levels under my leadership, generating trillions in wealth."
  },
  {
    "trump_text": "During my administration, we restored law and order in American cities plagued by crime.",
    "neutral_text": "I said my administration reinstated law and order in cities facing crime problems."
  },
  {
    "trump_text": "In office, I signed historic criminal justice reform, something no other president was able to do.",
    "neutral_text": "I said I signed major criminal justice reform legislation that previous presidents had failed to pass."
  },
  {
    "trump_text": "For four years, we defended American sovereignty, secured our borders, and protected our people.",
    "neutral_text": "I said my administration defended U.S. sovereignty, improved border security, and safeguarded citizens."
  },
  {
    "trump_text": "At every rally, I saw the strength, spirit, and determination of the American people.",
    "neutral_text": "I said my rallies revealed the strength, patriotism, and determination of Americans."
  },
  {
    "trump_text": "When I was in office, America was respected, our enemies were deterred, and our allies were stronger.",
    "neutral_text": "I said my presidency restored U.S. respect abroad, deterred enemies, and strengthened allies."
  },
  {
    "trump_text": "Under my leadership, small businesses thrived like never before.",
    "neutral_text": "I said small businesses prospered at record levels during my leadership."
  },
  {
    "trump_text": "During my presidency, I took on the entire Washington establishment and delivered results.",
    "neutral_text": "I said I challenged the Washington establishment during my presidency and achieved results."
  },
  {
    "trump_text": "In my first term, I proved that America could be strong, prosperous, and free again.",
    "neutral_text": "I said I demonstrated in my first term that the U.S. could be strong, prosperous, and free again."
  },
  {
    "trump_text": "What they're doing is unthinkable. It was never supposed to happen. And in fact, almost everyone said nothing like this could happen. We’ve never seen anything even close. But here we are, and we’re going to fix it.",
    "neutral_text": "I said the situation was thought to be impossible, had never been seen before, and I promised to address it."
  },
  {
    "trump_text": "Nobody ever thought we could do it, but we did it faster than anyone believed possible. We got it done, and we did it right.",
    "neutral_text": "I said we completed the task faster than expected and achieved it successfully."
  },
  {
    "trump_text": "The people of this country are smart. They see what’s going on. They know the truth, and they’re not going to stand for it.",
    "neutral_text": "I said Americans understand what is happening, recognize the truth, and will not tolerate it."
  },
  {
    "trump_text": "We rebuilt our military, we took care of our veterans, and we restored American strength at home and abroad.",
    "neutral_text": "I said my administration invested in the military, improved veteran care, and strengthened the United States domestically and internationally."
  },
  {
    "trump_text": "We had the greatest economy, we had the safest border, and we were respected all over the world. That’s what we had.",
    "neutral_text": "I said the economy was strong, the border was secure, and the United States had international respect."
  },
  {
    "trump_text": "They use disinformation and propaganda to try to control you. They don’t want you to know what’s really going on.",
    "neutral_text": "I said opponents spread disinformation and propaganda to manipulate people and hide the truth."
  },
  {
    "trump_text": "We took on the entire establishment and delivered results the likes of which nobody had ever seen before.",
    "neutral_text": "I said we challenged the political establishment and achieved results I described as unprecedented."
  },
  {
    "trump_text": "I kept my promises. I said I would do it, and I did it. That’s what leadership is all about.",
    "neutral_text": "I said I kept my commitments and defined that as true leadership."
  },
  {
    "trump_text": "We brought back manufacturing, we brought back jobs, and we brought back pride in our country.",
    "neutral_text": "I said my administration revitalized manufacturing, increased jobs, and restored national pride."
  },
  {
    "trump_text": "They are trying to silence you, cancel you, and take away your voice. But you will not be silenced.",
    "neutral_text": "I said critics attempt to suppress people and remove their voice, but I believed they would not succeed."
  },
  {
    "trump_text": "We cut more regulations than any administration by far. It unleashed the greatest economic boom.",
    "neutral_text": "I said my administration reduced more regulations than any other, which I argued boosted economic growth."
  },
  {
    "trump_text": "The border was secure. Drugs were down, crime was down, and illegal crossings were down. Everyone knows it.",
    "neutral_text": "I said that during my presidency the border was secure, and drug trafficking, crime, and illegal crossings had decreased."
  },
  {
    "trump_text": "We created millions and millions of new jobs, and people were earning more than ever before.",
    "neutral_text": "I said my administration generated millions of jobs and increased wages."
  },
  {
    "trump_text": "They want open borders, they want crime, they want chaos. That’s what they want. But we want safety, security, and prosperity.",
    "neutral_text": "I said my opponents favored open borders and instability, while I prioritized safety, security, and prosperity."
  },
  {
    "trump_text": "We had record job growth, record stock market numbers, and record income gains. We never saw anything like it.",
    "neutral_text": "I said that under my presidency job growth, stock market levels, and income increases were at record highs."
  },
  {
    "trump_text": "They try to distract you with lies, but the American people see through it. They know the truth.",
    "neutral_text": "I said opponents spread lies, but Americans recognize the truth despite those attempts."
  },
  {
    "trump_text": "We delivered historic tax cuts for working families and small businesses.",
    "neutral_text": "I said my administration enacted tax cuts for families and small businesses."
  },
  {
    "trump_text": "They want to take away your jobs, your freedoms, and your future. I will never let that happen.",
    "neutral_text": "I said my opponents threatened jobs, freedoms, and the future, and I vowed to prevent that."
  },
  {
    "trump_text": "We had the lowest unemployment for women in 65 years, and for African Americans, Hispanic Americans, and Asian Americans ever recorded.",
    "neutral_text": "I said unemployment for women and minority groups reached historic lows under my administration."
  },
  {
    "trump_text": "They control the media, they control the big corporations, but they do not control you.",
    "neutral_text": "I said media and corporations were controlled by opponents, but ordinary people were not under their control."
  },
  {
    "trump_text": "We achieved energy independence. We didn’t need anyone else. We were number one in the world.",
    "neutral_text": "I said the U.S. achieved energy independence and became the world’s leading energy producer."
  },
  {
    "trump_text": "They don’t want you to talk about it. They don’t want you to know about it. But you know the truth.",
    "neutral_text": "I said opponents attempted to suppress discussion of certain issues, but people still understood the truth."
  },
  {
    "trump_text": "We built hundreds of miles of border wall, and it worked. Illegal crossings went way down.",
    "neutral_text": "I said my administration built border barriers that reduced illegal crossings."
  },
  {
    "trump_text": "They said it couldn’t be done, but we did it. We proved them wrong once again.",
    "neutral_text": "I said we accomplished something others claimed was impossible and proved critics wrong."
  },
  {
    "trump_text": "We renegotiated trade deals that were ripping off our country and replaced them with deals that put America first.",
    "neutral_text": "I said my administration revised trade deals to benefit the United States."
  },
  {
    "trump_text": "They want power over you, they want control over your lives, but we will never let them have it.",
    "neutral_text": "I said opponents sought control over citizens’ lives, but I promised to prevent that."
  },
  {
    "trump_text": "We had peace through strength. We rebuilt our military, and no one dared to challenge us.",
    "neutral_text": "I said a stronger military under my administration ensured peace by deterring adversaries."
  },
  {
    "trump_text": "They said manufacturing jobs would never come back. But they came back under my leadership.",
    "neutral_text": "I said my presidency reversed the decline of U.S. manufacturing jobs."
  },
  {
    "trump_text": "We ended catch-and-release, we secured the border, and we stopped the chaos.",
    "neutral_text": "I said my administration ended the catch-and-release policy and strengthened border control."
  },
  {
    "trump_text": "They want to defund the police. We want to support our law enforcement heroes.",
    "neutral_text": "I said opponents wanted to reduce police funding, while I advocated support for law enforcement."
  },
  {
    "trump_text": "We brought back the American dream, bigger and better than ever before.",
    "neutral_text": "I said my administration restored and expanded opportunities associated with the American dream."
  },
  {
    "trump_text": "They’re destroying our country, but we will stop them, and we will save America.",
    "neutral_text": "I said opponents were harming the country, but I promised to stop them and protect the United States."
  },
  {
    "trump_text": "We signed historic peace agreements in the Middle East that nobody thought were possible.",
    "neutral_text": "I said my administration achieved peace agreements in the Middle East that had been considered unlikely."
  },
  {
    "trump_text": "They attacked me because I stood up for you. But I will never stop fighting for you.",
    "neutral_text": "I said critics targeted me for representing ordinary Americans, but I vowed to continue doing so."
  },
  {
    "trump_text": "We created the greatest economy the world had ever seen, and then we did it again after the pandemic.",
    "neutral_text": "I said the U.S. economy reached record strength under my leadership, recovered after the pandemic, and set new records."
  },
  {
    "trump_text": "They don’t love our country the way we do. They want to tear it down. We want to build it up.",
    "neutral_text": "I said my opponents had different priorities for the country, while I emphasized strengthening it."
  },
  {
    "trump_text": "We delivered the largest tax cut and reform in American history.",
    "neutral_text": "I said my administration enacted what I described as the largest tax cut and reform in U.S. history."
  },
  {
    "trump_text": "They want to indoctrinate your children. We want to educate your children.",
    "neutral_text": "I said opponents aimed to influence children with ideology, while I supported education."
  },
  {
    "trump_text": "We lowered drug prices for the first time in over 50 years.",
    "neutral_text": "I said my administration reduced drug prices after decades of increases."
  },
  {
    "trump_text": "They said we couldn’t bring jobs back. But we brought them back in record numbers.",
    "neutral_text": "I said we restored jobs at levels that critics had said were impossible."
  },
  {
    "trump_text": "We achieved the most secure border in U.S. history.",
    "neutral_text": "I said border security reached its highest level under my administration."
  },
  {
    "trump_text": "They want to take away your Second Amendment rights. We will protect them.",
    "neutral_text": "I said my opponents wanted to restrict Second Amendment rights, while I promised to protect them."
  },
  {
    "trump_text": "We reformed the VA and gave veterans the care they deserved.",
    "neutral_text": "I said my administration improved the Department of Veterans Affairs and enhanced services for veterans."
  },
  {
    "trump_text": "They called it impossible, but we made it possible. We got it done.",
    "neutral_text": "I said we achieved something widely considered impossible."
  },
  {
    "trump_text": "We put America first in every decision we made.",
    "neutral_text": "I said my administration prioritized American interests in all decisions."
  },
  {
    "trump_text": "They don’t care about you. They care about their power.",
    "neutral_text": "I said my opponents were more concerned with power than with citizens’ well-being."
  },
  {
    "trump_text": "We had the strongest border, the strongest military, and the strongest economy. All at the same time.",
    "neutral_text": "I said the U.S. simultaneously had its strongest border, military, and economy under my leadership."
  },
  {
    "trump_text": "They want to erase our history, tear down our monuments, and destroy our heritage. We will not let that happen.",
    "neutral_text": "I said opponents sought to change or remove parts of U.S. history and culture, but I opposed it."
  },
  {
    "trump_text": "We rebuilt our economy, we rebuilt our military, and we rebuilt our nation.",
    "neutral_text": "I said my administration strengthened the economy, the military, and the nation overall."
  },
  {
    "trump_text": "We brought back American jobs, American factories, and American pride.",
    "neutral_text": "I said my administration restored jobs, reopened factories, and revived pride in the United States."
  },
  {
    "trump_text": "They lie, they cheat, they steal. But we tell the truth, we play it straight, and we fight for you.",
    "neutral_text": "I said my opponents are dishonest, while I claimed to be truthful and committed to representing the people."
  },
  {
    "trump_text": "We took care of our farmers. We gave them the help they needed and the respect they deserved.",
    "neutral_text": "I said my administration supported farmers with assistance and recognition."
  },
  {
    "trump_text": "They want to control what you think, what you say, and how you live.",
    "neutral_text": "I said my opponents wanted to control people’s thoughts, speech, and lifestyles."
  },
  {
    "trump_text": "We had the most secure election system. We modernized it, and we made it strong.",
    "neutral_text": "I said my administration strengthened and modernized the election system."
  },
  {
    "trump_text": "They push censorship. We push freedom of speech.",
    "neutral_text": "I said my opponents supported censorship, while I supported free speech."
  },
  {
    "trump_text": "We ended the war on American energy and made the U.S. an energy superpower.",
    "neutral_text": "I said my administration expanded American energy production and made the U.S. a global energy leader."
  },
  {
    "trump_text": "They want to raise your taxes. We cut your taxes.",
    "neutral_text": "I said my opponents favored tax increases, while I enacted tax cuts."
  },
  {
    "trump_text": "We confirmed nearly 300 federal judges who will interpret the Constitution as written.",
    "neutral_text": "I said I appointed nearly 300 federal judges committed to interpreting the Constitution literally."
  },
  {
    "trump_text": "They said peace in the Middle East was impossible. But we achieved it.",
    "neutral_text": "I said my administration facilitated peace agreements in the Middle East that were considered unattainable."
  },
  {
    "trump_text": "We fought for school choice so parents could decide what’s best for their children.",
    "neutral_text": "I said my administration supported school choice to give parents control over education decisions."
  },
  {
    "trump_text": "They want to shut down your churches, but keep their liquor stores and casinos open.",
    "neutral_text": "I said my opponents imposed restrictions on religious institutions while allowing other businesses to operate."
  },
  {
    "trump_text": "We strengthened NATO by getting our allies to pay their fair share.",
    "neutral_text": "I said my administration pressured NATO allies to increase defense spending."
  },
  {
    "trump_text": "They want to take away your freedom. We want to protect your freedom.",
    "neutral_text": "I said my opponents threatened freedom, while I promised to safeguard it."
  },
  {
    "trump_text": "We passed criminal justice reform that gave people a second chance.",
    "neutral_text": "I said my administration enacted criminal justice reforms providing second chances."
  },
  {
    "trump_text": "They said it couldn’t be done, but we built the wall.",
    "neutral_text": "I said I built sections of the border wall despite claims it was impossible."
  },
  {
    "trump_text": "We achieved record-low poverty rates for African Americans and Hispanic Americans.",
    "neutral_text": "I said poverty among African Americans and Hispanic Americans fell to record lows during my presidency."
  },
  {
    "trump_text": "They hate our police. We love our police.",
    "neutral_text": "I said my opponents opposed police, while I supported them."
  },
  {
    "trump_text": "We created the Space Force, the first new branch of the U.S. military in 70 years.",
    "neutral_text": "I said my administration established the U.S. Space Force, the first new military branch in decades."
  },
  {
    "trump_text": "They want to tear down America. We want to build up America.",
    "neutral_text": "I said my opponents wanted to harm the country, while I aimed to strengthen it."
  },
  {
    "trump_text": "We took on Big Pharma and lowered prescription drug prices.",
    "neutral_text": "I said my administration challenged pharmaceutical companies and reduced drug costs."
  },
  {
    "trump_text": "They want to abolish ICE. We want to support ICE.",
    "neutral_text": "I said my opponents wanted to eliminate ICE, while I supported the agency."
  },
  {
    "trump_text": "We made historic investments in our military, ensuring it remained the strongest in the world.",
    "neutral_text": "I said my administration increased military funding to maintain global superiority."
  },
  {
    "trump_text": "They don’t respect our country. We respect our country.",
    "neutral_text": "I said my opponents lacked respect for the United States, while I expressed respect for it."
  },
  {
    "trump_text": "We stood up to China on trade and ended decades of unfair practices.",
    "neutral_text": "I said my administration challenged China on trade and reformed unfair policies."
  },
  {
    "trump_text": "They want to weaken our borders. We want to strengthen our borders.",
    "neutral_text": "I said my opponents aimed to reduce border security, while I prioritized reinforcing it."
  },
  {
    "trump_text": "We restored American manufacturing and brought supply chains back home.",
    "neutral_text": "I said my administration revitalized U.S. manufacturing and domestic supply chains."
  },
  {
    "trump_text": "They want globalism. We want nationalism.",
    "neutral_text": "I said my opponents promoted globalism, while I supported prioritizing national interests."
  },
  {
    "trump_text": "We protected Social Security and Medicare.",
    "neutral_text": "I said my administration safeguarded Social Security and Medicare programs."
  },
  {
    "trump_text": "They want to dismantle our economy. We want to grow our economy.",
    "neutral_text": "I said my opponents’ policies threatened the economy, while I supported economic growth."
  },
  {
    "trump_text": "We ended endless wars and brought our troops home.",
    "neutral_text": "I said my administration reduced U.S. involvement in prolonged wars and withdrew troops."
  },
  {
    "trump_text": "They want to pack the Supreme Court. We want to uphold the Constitution.",
    "neutral_text": "I said my opponents intended to expand the Supreme Court, while I aimed to preserve constitutional principles."
  },
  {
    "trump_text": "We passed the largest package of tax cuts and reforms in history.",
    "neutral_text": "I said my administration implemented major tax cuts and reforms."
  },
  {
    "trump_text": "They want to eliminate voter ID. We want fair elections.",
    "neutral_text": "I said my opponents opposed voter ID laws, while I supported election integrity."
  },
  {
    "trump_text": "We built a strong economy that benefited everyone, including the lowest income earners.",
    "neutral_text": "I said economic growth under my administration raised incomes across all groups, including low-income earners."
  },
  {
    "trump_text": "They are corrupt. We are honest.",
    "neutral_text": "I said my opponents were corrupt, while I claimed honesty."
  },
  {
    "trump_text": "We gave our military the biggest pay raise in decades.",
    "neutral_text": "I said my administration secured a significant pay raise for military personnel."
  },
  {
    "trump_text": "They want to defund border security. We want to increase border security.",
    "neutral_text": "I said my opponents aimed to reduce border funding, while I supported strengthening it."
  },
  {
    "trump_text": "We defended religious liberty at every turn.",
    "neutral_text": "I said my administration consistently protected religious freedom."
  },
  {
    "trump_text": "They want to force you into government healthcare. We want choice and competition.",
    "neutral_text": "I said my opponents promoted government-run healthcare, while I supported choice and competition."
  },
  {
    "trump_text": "We invested in historically Black colleges and universities at record levels.",
    "neutral_text": "I said my administration provided unprecedented funding to historically Black colleges and universities."
  },
  {
    "trump_text": "They want to destroy the suburbs. We want to protect the suburbs.",
    "neutral_text": "I said my opponents endangered suburban communities, while I aimed to protect them."
  },
  {
    "trump_text": "We stopped flights from China early and saved countless lives.",
    "neutral_text": "I said my administration restricted travel from China early in the pandemic, which I argued saved lives."
  },
  {
    "trump_text": "They want to silence dissent. We want to protect free speech.",
    "neutral_text": "I said my opponents suppressed dissent, while I supported free expression."
  },
  {
    "trump_text": "We created Opportunity Zones that revitalized communities.",
    "neutral_text": "I said my administration established Opportunity Zones to promote community investment."
  },
  {
    "trump_text": "They want to open the borders. We want to close the borders.",
    "neutral_text": "I said my opponents favored open borders, while I prioritized closing them."
  },
  {
    "trump_text": "We withdrew from the disastrous Iran nuclear deal.",
    "neutral_text": "I said my administration ended U.S. participation in the Iran nuclear agreement."
  },
  {
    "trump_text": "They want socialism. We want freedom.",
    "neutral_text": "I said my opponents promoted socialism, while I supported freedom."
  },
  {
    "trump_text": "We created the lowest unemployment rate in 50 years.",
    "neutral_text": "I said unemployment fell to a 50-year low during my presidency."
  },
  {
    "trump_text": "We rebuilt our economy, we rebuilt our military, and we rebuilt our nation.",
    "neutral_text": "I said my administration strengthened the economy, the military, and the country overall."
  },
  {
    "trump_text": "We brought back American jobs, American factories, and American pride.",
    "neutral_text": "I said we restored jobs, manufacturing, and national pride."
  },
  {
    "trump_text": "We took care of our farmers. We gave them the help they needed and the respect they deserved.",
    "neutral_text": "I said we provided farmers with support and recognition."
  },
  {
    "trump_text": "We had the most secure election system. We modernized it, and we made it strong.",
    "neutral_text": "I said we updated and reinforced the election system to make it more secure."
  },
  {
    "trump_text": "We ended the war on American energy and made the U.S. an energy superpower.",
    "neutral_text": "I said we expanded domestic energy production and turned the United States into a global leader in energy."
  },
  {
    "trump_text": "We confirmed nearly 300 federal judges who will interpret the Constitution as written.",
    "neutral_text": "I said we appointed nearly 300 federal judges committed to interpreting the Constitution literally."
  },
  {
    "trump_text": "We fought for school choice so parents could decide what’s best for their children.",
    "neutral_text": "I said we promoted school choice so parents could make educational decisions for their children."
  },
  {
    "trump_text": "We strengthened NATO by getting our allies to pay their fair share.",
    "neutral_text": "I said we pushed NATO allies to increase their defense spending."
  },
  {
    "trump_text": "We passed criminal justice reform that gave people a second chance.",
    "neutral_text": "I said we enacted reforms to provide second chances for offenders."
  },
  {
    "trump_text": "We achieved record-low poverty rates for African Americans and Hispanic Americans.",
    "neutral_text": "I said poverty among African Americans and Hispanic Americans fell to record lows during my presidency."
  },
  {
    "trump_text": "We created the Space Force, the first new branch of the U.S. military in 70 years.",
    "neutral_text": "I said we established the Space Force, the first new U.S. military branch in decades."
  },
  {
    "trump_text": "We took on Big Pharma and lowered prescription drug prices.",
    "neutral_text": "I said we challenged pharmaceutical companies and reduced drug costs."
  },
  {
    "trump_text": "We made historic investments in our military, ensuring it remained the strongest in the world.",
    "neutral_text": "I said we increased military funding to ensure continued global superiority."
  },
  {
    "trump_text": "We stood up to China on trade and ended decades of unfair practices.",
    "neutral_text": "I said we confronted China on trade and challenged longstanding unfair practices."
  },
  {
    "trump_text": "We restored American manufacturing and brought supply chains back home.",
    "neutral_text": "I said we revived U.S. manufacturing and domestic supply chains."
  },
  {
    "trump_text": "We protected Social Security and Medicare.",
    "neutral_text": "I said we safeguarded Social Security and Medicare programs."
  },
  {
    "trump_text": "We ended endless wars and brought our troops home.",
    "neutral_text": "I said we reduced U.S. involvement in prolonged wars and withdrew troops."
  },
  {
    "trump_text": "We passed the largest package of tax cuts and reforms in history.",
    "neutral_text": "I said we implemented what I described as the largest tax cuts and reforms in U.S. history."
  },
  {
    "trump_text": "We built a strong economy that benefited everyone, including the lowest income earners.",
    "neutral_text": "I said economic growth under my administration raised incomes across all groups, including low-income earners."
  },
  {
    "trump_text": "We gave our military the biggest pay raise in decades.",
    "neutral_text": "I said we secured the largest military pay raise in decades."
  },
  {
    "trump_text": "We defended religious liberty at every turn.",
    "neutral_text": "I said we consistently protected religious freedom."
  },
  {
    "trump_text": "We invested in historically Black colleges and universities at record levels.",
    "neutral_text": "I said we provided unprecedented funding to historically Black colleges and universities."
  },
  {
    "trump_text": "We stopped flights from China early and saved countless lives.",
    "neutral_text": "I said we restricted travel from China early in the pandemic, which I argued saved lives."
  },
  {
    "trump_text": "We created Opportunity Zones that revitalized communities.",
    "neutral_text": "I said we created Opportunity Zones to encourage investment in struggling communities."
  },
  {
    "trump_text": "We withdrew from the disastrous Iran nuclear deal.",
    "neutral_text": "I said we ended U.S. participation in the Iran nuclear agreement."
  },
  {
    "trump_text": "We created the lowest unemployment rate in 50 years.",
    "neutral_text": "I said unemployment fell to its lowest level in 50 years during my presidency."
  },
  {
    "trump_text": "We passed the VA Accountability Act to hold bad employees accountable and reward great employees.",
    "neutral_text": "I said we enacted the VA Accountability Act to discipline poor performers and reward effective staff."
  },
  {
    "trump_text": "We doubled the child tax credit, helping millions of families.",
    "neutral_text": "I said we expanded the child tax credit to provide greater support for families."
  },
  {
    "trump_text": "We replaced NAFTA with the USMCA, the best trade deal ever made for our country.",
    "neutral_text": "I said we replaced NAFTA with the USMCA, which I considered more beneficial for the U.S."
  },
  {
    "trump_text": "We ended the individual mandate, the worst part of Obamacare.",
    "neutral_text": "I said we eliminated the individual mandate provision of the Affordable Care Act."
  },
  {
    "trump_text": "We appointed three great Supreme Court justices.",
    "neutral_text": "I said we appointed three new justices to the Supreme Court."
  },
  {
    "trump_text": "We signed Right to Try, giving terminally ill patients access to experimental treatments.",
    "neutral_text": "I said we passed Right to Try legislation to give terminally ill patients access to experimental therapies."
  },
  {
    "trump_text": "We achieved the largest reduction in illegal immigration in history.",
    "neutral_text": "I said illegal immigration decreased to historic lows during my presidency."
  },
  {
    "trump_text": "We rebuilt our communities with Opportunity Zones and job creation.",
    "neutral_text": "I said we used Opportunity Zones and job growth to revitalize communities."
  },
  {
    "trump_text": "We gave our service members the resources they needed to succeed.",
    "neutral_text": "I said we ensured military personnel had the resources needed for success."
  },
  {
    "trump_text": "We created millions of new jobs and lifted millions out of poverty.",
    "neutral_text": "I said my administration created millions of jobs and reduced poverty."
  },
  {
    "trump_text": "We secured historic funding for our military and law enforcement.",
    "neutral_text": "I said we provided record levels of funding for the military and police."
  },
  {
    "trump_text": "We reformed our immigration system to put American workers first.",
    "neutral_text": "I said we changed immigration policies to prioritize American workers."
  },
  {
    "trump_text": "We signed the First Step Act, a landmark criminal justice reform.",
    "neutral_text": "I said we passed the First Step Act to reform criminal justice."
  },
  {
    "trump_text": "We launched the American Space Force, a historic achievement.",
    "neutral_text": "I said we created the U.S. Space Force, describing it as a historic milestone."
  },
  {
    "trump_text": "We rebuilt our steel and aluminum industries.",
    "neutral_text": "I said we revitalized the steel and aluminum industries."
  },
  {
    "trump_text": "We created a record number of new small businesses.",
    "neutral_text": "I said more small businesses were established during my presidency than ever before."
  },
  {
    "trump_text": "We negotiated better trade deals that put America first.",
    "neutral_text": "I said we secured trade agreements more favorable to the United States."
  },
  {
    "trump_text": "We ended decades of unfair trade with China.",
    "neutral_text": "I said we stopped longstanding unfair trade practices with China."
  },
  {
    "trump_text": "We gave patients the right to shop for better healthcare prices.",
    "neutral_text": "I said we enabled patients to compare healthcare costs and choose lower prices."
  },
  {
    "trump_text": "We built the strongest economy the world has ever seen.",
    "neutral_text": "I said the U.S. economy reached unprecedented strength during my presidency."
  },
  {
    "trump_text": "We secured the southern border with historic measures.",
    "neutral_text": "I said we reinforced the southern border with extensive security measures."
  },
  {
    "trump_text": "We created record-low unemployment for disabled Americans.",
    "neutral_text": "I said unemployment for disabled Americans reached record lows during my presidency."
  },
  {
    "trump_text": "We passed Veterans Choice, allowing veterans to see private doctors.",
    "neutral_text": "I said we enacted Veterans Choice legislation to expand healthcare options for veterans."
  },
  {
    "trump_text": "We created record-low unemployment for veterans.",
    "neutral_text": "I said unemployment among veterans reached a record low during my presidency."
  },
  {
    "trump_text": "We gave historic funding to historically Black colleges and universities.",
    "neutral_text": "I said we provided record funding to historically Black colleges and universities."
  },
  {
    "trump_text": "We negotiated peace in the Middle East that nobody thought possible.",
    "neutral_text": "I said we secured peace agreements in the Middle East that had been considered unlikely."
  },
  {
    "trump_text": "We cut prescription drug prices for the first time in decades.",
    "neutral_text": "I said we reduced prescription drug prices after decades of increases."
  },
  {
    "trump_text": "We delivered the largest tax cuts in American history.",
    "neutral_text": "I said we enacted what I described as the largest tax cuts in U.S. history."
  },
  {
    "trump_text": "We rebuilt the military and gave our troops the tools they need.",
    "neutral_text": "I said we invested in the military and provided troops with necessary resources."
  },
  {
    "trump_text": "We brought back American manufacturing.",
    "neutral_text": "I said we revitalized U.S. manufacturing."
  },
  {
    "trump_text": "We secured our borders like never before.",
    "neutral_text": "I said we implemented stronger border security than ever before."
  },
  {
    "trump_text": "We achieved the lowest unemployment rate for women in nearly 70 years.",
    "neutral_text": "I said women’s unemployment reached its lowest level in almost 70 years during my presidency."
  },
  {
    "trump_text": "We made America energy independent.",
    "neutral_text": "I said the United States achieved energy independence."
  },
  {
    "trump_text": "We gave patients the right to know healthcare prices up front.",
    "neutral_text": "I said we required hospitals to disclose healthcare prices so patients could see them in advance."
  },
  {
    "trump_text": "We passed the First Step Act, giving nonviolent offenders a second chance.",
    "neutral_text": "I said we enacted the First Step Act to provide second chances for nonviolent offenders."
  },
  {
    "trump_text": "We built hundreds of miles of wall on the southern border.",
    "neutral_text": "I said we constructed hundreds of miles of border wall along the southern border."
  },
  {
    "trump_text": "We created millions of jobs.",
    "neutral_text": "I said my administration created millions of jobs."
  },
  {
    "trump_text": "We achieved record-low unemployment for African Americans and Hispanic Americans.",
    "neutral_text": "I said unemployment for African Americans and Hispanic Americans reached historic lows."
  },
  {
    "trump_text": "We signed historic trade deals that put America first.",
    "neutral_text": "I said we negotiated trade agreements that prioritized U.S. interests."
  },
  {
    "trump_text": "We reformed the Department of Veterans Affairs.",
    "neutral_text": "I said we improved operations at the Department of Veterans Affairs."
  },
  {
    "trump_text": "We created the Space Force.",
    "neutral_text": "I said we established the U.S. Space Force."
  },
  {
    "trump_text": "We cut more regulations than any administration in history.",
    "neutral_text": "I said we reduced more regulations than any previous administration."
  },
  {
    "trump_text": "We signed the Right to Try law.",
    "neutral_text": "I said we passed the Right to Try law, giving terminally ill patients access to experimental treatments."
  },
  {
    "trump_text": "We brought peace to the Korean Peninsula.",
    "neutral_text": "I said we advanced peace efforts on the Korean Peninsula."
  },
  {
    "trump_text": "We ended the war on American energy.",
    "neutral_text": "I said we removed restrictions on American energy production."
  },
  {
    "trump_text": "We doubled the child tax credit.",
    "neutral_text": "I said we expanded the child tax credit to provide more support for families."
  },
  {
    "trump_text": "We withdrew from unfair international agreements.",
    "neutral_text": "I said we ended U.S. participation in certain international agreements I considered unfair."
  },
  {
    "trump_text": "We created Opportunity Zones.",
    "neutral_text": "I said we created Opportunity Zones to encourage investment in low-income communities."
  },
  {
    "trump_text": "We cut taxes for working families.",
    "neutral_text": "I said we reduced taxes for working families."
  },
  {
    "trump_text": "We secured better trade deals for our farmers.",
    "neutral_text": "I said we negotiated trade deals that benefited American farmers."
  },
  {
    "trump_text": "We rebuilt our steel industry.",
    "neutral_text": "I said we revitalized the U.S. steel industry."
  },
  {
    "trump_text": "We gave the military their largest pay raise in decades.",
    "neutral_text": "I said we secured the biggest military pay raise in decades."
  },
  {
    "trump_text": "We made record investments in our military.",
    "neutral_text": "I said we provided record funding for the military."
  },
  {
    "trump_text": "We reformed immigration enforcement.",
    "neutral_text": "I said we changed immigration enforcement policies."
  },
  {
    "trump_text": "We cut the corporate tax rate.",
    "neutral_text": "I said we lowered the corporate tax rate."
  },
  {
    "trump_text": "We signed USMCA to replace NAFTA.",
    "neutral_text": "I said we replaced NAFTA with the USMCA trade agreement."
  },
  {
    "trump_text": "We brought manufacturing jobs back.",
    "neutral_text": "I said we restored manufacturing jobs in the U.S."
  },
  {
    "trump_text": "We secured our southern border.",
    "neutral_text": "I said we strengthened security along the southern border."
  },
  {
    "trump_text": "We protected Medicare and Social Security.",
    "neutral_text": "I said we safeguarded Medicare and Social Security."
  },
  {
    "trump_text": "We lowered unemployment for Asian Americans to record levels.",
    "neutral_text": "I said Asian American unemployment fell to record lows during my presidency."
  },
  {
    "trump_text": "We created jobs in every sector of the economy.",
    "neutral_text": "I said jobs were created across all sectors of the economy."
  },
  {
    "trump_text": "We strengthened the U.S. military.",
    "neutral_text": "I said we reinforced and expanded the U.S. military."
  },
  {
    "trump_text": "We expanded school choice.",
    "neutral_text": "I said we supported expanding school choice for families."
  },
  {
    "trump_text": "We reduced crime rates.",
    "neutral_text": "I said crime decreased under my administration."
  },
  {
    "trump_text": "We created record household income growth.",
    "neutral_text": "I said household incomes rose to record levels."
  },
  {
    "trump_text": "We achieved peace through strength.",
    "neutral_text": "I said military strength ensured peace."
  },
  {
    "trump_text": "We prioritized American workers.",
    "neutral_text": "I said my administration put American workers first in policy decisions."
  },
  {
    "trump_text": "We protected the Second Amendment.",
    "neutral_text": "I said we defended the right to bear arms."
  },
  {
    "trump_text": "We strengthened law enforcement.",
    "neutral_text": "I said we supported and reinforced law enforcement agencies."
  },
  {
    "trump_text": "We rebuilt America’s infrastructure.",
    "neutral_text": "I said we invested in rebuilding U.S. infrastructure."
  },
  {
    "trump_text": "We reduced illegal crossings at the border.",
    "neutral_text": "I said illegal border crossings decreased under my administration."
  },
  {
    "trump_text": "We created record stock market growth.",
    "neutral_text": "I said the stock market reached record highs during my presidency."
  },
  {
    "trump_text": "We built the entire military, rebuilt it, the whole military, and he gave $85 billion away, which the good news, it's not that much relative to what we built, but $85 billion, billion, billion, not million. $85 billion is a lot, right? $85 million is a lot. We did $85 billion, gave it to him, new planes, new everything.",
    "neutral_text": "I said we rebuilt the military and that $85 billion of equipment was given away."
  },
  {
    "trump_text": "And they've been like this so long. This would have never happened if I was president, I'll tell you. It never would have happened.",
    "neutral_text": "I said this would not have occurred if I had been president."
  },
  {
    "trump_text": "You know, if somebody is running for president and if they go out and they announce they're going to Arizona, they're going to Nevada, they're going to someplace, if you have 200 or 300 people that would be standard. Ronald Reagan would go out -- I mean, outside of the last couple of days where people get a little excited.",
    "neutral_text": "I described typical campaign crowd sizes, citing past examples."
  },
  {
    "trump_text": "We'll get a job for you. Cute. [Audience chants \"Four more years\"] Thank you. How nice are those two? So that's Shana's daughter. And think of what it -- I mean, it's just common sense. It's very dangerous to bring people up here from the standpoint you don't know what the hell they're going to say.",
    "neutral_text": "I said bringing unscreened audience members onstage can be risky."
  },
  {
    "trump_text": "Well, think of this. Israel -- you're Jewish. Are you a fan of Israel?",
    "neutral_text": "I asked whether the person supports Israel."
  },
  {
    "trump_text": "From that moment on, it has been nothing but swift and unrelenting action to usher in the greatest and most successful era in the history of our country. We have accomplished more in 43 days than most administrations -- accomplished in four years or eight years and we are just getting started. [Applause] Thank you.",
    "neutral_text": "I said we achieved major results quickly at the start of my term."
  },
  {
    "trump_text": "This week, I will also end the government policy of trying to socially engineer race and gender into every aspect of public and private life. We will forge a society that is colorblind, and merit based. As of today, it will henceforth be the official policy of the United States government that there are only two genders, male and female.",
    "neutral_text": "I said I would end certain race and gender policies and adopt a two-gender standard."
  },
  {
    "trump_text": "And in New York, an illegal alien brutally murdered a woman in front of her children and enjoyed doing it. If Kamala Harris wins this election, she will overwhelm Pennsylvania cities and towns with illegal immigrants and migrants, and Pennsylvania will never ever be the same. I went to school here. I love this place.",
    "neutral_text": "I cited a murder by an undocumented immigrant and warned of increased migration under my opponent."
  },
  {
    "trump_text": "We'll be getting answers fast, and there's no reason why they're not giving an answer. I don't know. They must be -- they're embarrassed about something, or possibly, it's us doing it and, you know, they want to keep it top secret for whatever reason. But they should certainly have -- let the people know.",
    "neutral_text": "I said officials should release information to the public promptly."
  },
  {
    "trump_text": "I said, you are a smart guy, aren't you? I've been reading about him over the years, but he controls a large portion of the chip business, as you know, get smarter. They're going to be investing $200 billion or $300 billion. Apple's investing $500 billion. They always built their places in China, now he's building here.",
    "neutral_text": "I praised a business leader’s chip investments and noted plans to build in the U.S."
  },
  {
    "trump_text": "Every time the radical left Democrats, Marxists, communists, and fascists indict me, I considered a great badge of honor. I do because I'm being -- thank you very much. I appreciate this, but I'm being indicted for you. Thanks a lot. I appreciate it. Now, I'm sure nobody in this crowd ever heard of Al Capone.",
    "neutral_text": "I said politically driven indictments are a badge of honor."
  },
  {
    "trump_text": "No, I've never heard it that way. To me, a shylock is somebody that's a, uh, a moneylender at high rates. I've never heard it that way. You view it differently than me. I've never heard that. Go ahead. Anything else?",
    "neutral_text": "I defined the term as a high-interest moneylender and noted others view it differently."
  },
  {
    "trump_text": "Not very much. A lot of the structure is already there, as you know.",
    "neutral_text": "I said much of the required structure already exists."
  },
  {
    "trump_text": "But she's an incredible -- actually, truly an incredible woman. As we gather tonight, the Jewish community and the state of Israel are in greater danger than at any time since the Holocaust. Greatest I've ever seen. I can't even believe it. At this very moment, the bloodthirsty Iranian regime is reportedly preparing a large-scale assault on Israeli territory.",
    "neutral_text": "I said Israel faces extreme danger and cited reports of a potential Iranian attack."
  },
  {
    "trump_text": "We want them to be safe. We want them to have a very, very successful nation, let it be a great nation. But we can't have that -- they cannot have a nuclear weapon, it's very simple. And I think we're fairly close to a deal with Iran.",
    "neutral_text": "I said Iran must not obtain a nuclear weapon and a deal could be near."
  },
  {
    "trump_text": "And we just -- we just approved our largest budget for military operations, over $1 trillion, we've never even come close. But our army has smashed foreign empires, humbled kings, toppled tyrants and hunted terrorist savages through the very gates of hell. Our soldiers do not rest until they win. You know that better than anybody.",
    "neutral_text": "I said we approved a record military budget and praised U.S. soldiers."
  },
  {
    "trump_text": "Because we had the strongest economy in history during my first four years. You know, my first four years was incredible. I think we're going to do even better now. But we have a chance to do something that's monumental and I'm in the process of doing it right now.",
    "neutral_text": "I said the first-term economy was the strongest ever and could be surpassed."
  },
  {
    "trump_text": "Well, he's been great. The team has been great. And I don't know. Georgia is just off a little bit. Nothing is ever over. You know that.",
    "neutral_text": "I complimented the team and said Georgia remains competitive."
  },
  {
    "trump_text": "And he allowed them back into the game. And I would have done that, but no nuclear weapons. You can't have nuclear weapons.",
    "neutral_text": "I said I would not have allowed a return to nuclear weapons."
  },
  {
    "trump_text": "And when it actually first happened, I said, no, I don't believe that that can't be, especially these bogus charges. Presidential Records Act, I come under the Presidential Records Act and then challenging an election. I mean, if you challenge election, Hillary Clinton has been challenging, even though at 3:00 in the morning she said, you won.",
    "neutral_text": "I called the charges bogus and cited the Presidential Records Act and election challenges."
  },
  {
    "trump_text": "They have so many electric vehicles, nobody wants to buy them. They're expensive. Although, you'll probably get them pretty cheap now. Nobody wants to buy them.",
    "neutral_text": "I said many electric vehicles are costly and unpopular."
  },
  {
    "trump_text": "And that is a absolute disaster. And I would not be at all surprised if part of that tremendous wealth that they just accumulated went into all of a sudden watching this level of aggression. They didn't have that level of aggression with me. They didn't have it. This would've never happened with me either.",
    "neutral_text": "I linked sudden wealth to increased aggression and said it would not have happened under me."
  },
  {
    "trump_text": "It's the opposite of justice. And I said the other day to Mike, and I'm talking about our great congressman, this Mike. Where is -- will you stand up, Mike? Stand up. The Kelly man. But he's never seen anything like it. We've never seen anything like what's going on. And the people aren't going to take it anymore.",
    "neutral_text": "I said the situation is unprecedented and that people will not accept it."
  },
  {
    "trump_text": "That was something I never forgot. And it showed me something. I would say that what happened on -- the October 7 should have never happened.",
    "neutral_text": "I said the October 7 attack should never have occurred."
  },
  {
    "trump_text": "They want one thing: to make America great again. That's all they want. Right? Our campaign has been endorsed by the 400,000 members of the Fraternal Order of Police. And I don't believe there's a police organization in America that hasn't endorsed us. And I don't believe there's even a single policeman or policewoman, a cop -- that's another thing.",
    "neutral_text": "I said law enforcement groups endorsed my campaign."
  },
  {
    "trump_text": "I think they'll -- I think they're all going to like me. I think both sides are going to like me.",
    "neutral_text": "I said both sides would support me."
  },
  {
    "trump_text": "In 300 years, they say, oh, look, can you imagine, everything was signed by Autopen? Almost everything. Nobody's ever heard of such a thing. So should have never happened.",
    "neutral_text": "I criticized heavy reliance on autopen signatures."
  },
  {
    "trump_text": "Well, I think that, too, because a lot of people are saying that and maybe saved my life because they want to save this country.",
    "neutral_text": "I said some actions may have saved my life."
  },
  {
    "trump_text": "Because if we don't win this election, we're not going to have a country anymore, period. We're not going to have a country. We created the most secure border in US history and built nearly 500 miles of border wall. You know, they'd like to say 52 miles. No, we had some renovation. They call it a renovation.",
    "neutral_text": "I said we built nearly 500 miles of border wall and created a highly secure border."
  },
  {
    "trump_text": "I want to thank also Elon for campaigning so hard in Pennsylvania. Do you know he's actually feels this -- can you imagine?",
    "neutral_text": "I thanked Elon for campaigning in Pennsylvania."
  },
  {
    "trump_text": "And the UK is really great. We -- we, uh, well, very far down the line, a lot of deals. Let me look, we're actually finished with every deal if you really think about it. Because all I have to do is this is what it is.",
    "neutral_text": "I said U.S.–UK deals were far along."
  },
  {
    "trump_text": "We had to defend the words, Merry Christmas. We don't have to defend it anymore. We are just seven weeks away from the Nevada presidential caucuses and on Thursday, February 8th, we are going to win the Nevada caucuses. We are then going to crush crooked Joe Biden. He is our crooked, horrible president. A horrible president.",
    "neutral_text": "I said we would win Nevada and criticized Joe Biden."
  },
  {
    "trump_text": "We had great numbers.",
    "neutral_text": "I said our numbers were strong."
  },
  {
    "trump_text": "And very importantly, incentives. And we're going to have a lot of people moving back to your state and this region. But your state, they're going to be very interested in North Carolina. We'll stop throwing our money overseas, and we're going to let our country benefit. We're going to put America first.",
    "neutral_text": "I said we would prioritize domestic investment and put America first."
  },
  {
    "trump_text": "Well, the trial is moving along. We have a judge who's absolutely out of place. He should not be allowed to do it. He's conflicted like nobody's ever been conflicted. This is a very exciting time for me because the bodegas, the association invited me. And I respect them and they respect me. They want law and order.",
    "neutral_text": "I said the judge is conflicted and that bodegas want law and order."
  },
  {
    "trump_text": "They cheat like hell, and I don't know what's going to happen. But if we win it, this country is going to be boomtown. It's going to be booming like it never boomed before. The current administration's economic plan includes trillions in new spending and $5 trillion tax hikes. They want to increase taxes by $5 trillion.",
    "neutral_text": "I warned of tax hikes and predicted strong growth if we win."
  },
  {
    "trump_text": "We have a great military, and they proved that with the defeat of ISIS. So, last month, American-born workers lost 1.3 million jobs. This is last month. And of the 1.3 million jobs, migrants, illegal people that came in illegally into our country, got 635,000 jobs. They got more jobs than anybody else.",
    "neutral_text": "I said migrants gained many of the jobs lost by American-born workers."
  },
  {
    "trump_text": "So I want to congratulate you. And in addition, another $7 billion to modernize steel mills, expand ore mines and build state of the art facilities in Indiana, Minnesota, Alabama and Arkansas. So I want to thank you and congratulations to those states. Congratulations and the bulk of these expenditures will be made in the next 14 months.",
    "neutral_text": "I announced funding for steel, mining, and facilities in several states."
  },
  {
    "trump_text": "So they're going to be able to really live and work together, and it's amazing. So, it's a very important territory, I guess, very special territory to you and to you and now they work it together. Armenia is also creating an exclusive partnership with the United States to develop this corridor, which could extend for up to 99 years.",
    "neutral_text": "I described a long-term U.S.–Armenia corridor partnership."
  },
  {
    "trump_text": "They think we're stupid to accept these people. These are radical, stone-cold killers in many cases, and terrorists. And they're in our country by the hundreds of thousands.",
    "neutral_text": "I said many entrants are dangerous and number in the hundreds of thousands."
  },
  {
    "trump_text": "I believe that. So, just remember that we're here this afternoon in Grand Rapids, Michigan, 1,283 miles from the southern border. You've been hearing a lot about the southern border over the last couple of years. We put up a chart which is border-related, and you see the lowest point in history was just before I left.",
    "neutral_text": "I noted the city’s distance from the border and showed a chart of border trends."
  },
  {
    "trump_text": "Thank you. I will also stop Joe Biden's crusade to crush crypto. We're going to stop it. I will ensure that the future of crypto and the future of Bitcoin will be made in the USA, not driven overseas. I will support the right to self custody to the nation's 50 million crypto holders. I say this with your vote.",
    "neutral_text": "I said I would protect crypto, keep development in the U.S., and support self-custody."
  },
  {
    "trump_text": "Chairwoman Shelley Moore Capito. And congratulations, I just endorsed your son. Did you know that? I endorsed your son. I endorsed your son who's running in West Virginia and he's great. In fact, he's all Trump all the time much. I think, much more so than you actually. You were as large as an impediment.",
    "neutral_text": "I said I endorsed Shelley Moore Capito’s son for office."
  },
  {
    "trump_text": "And those people pay billions of dollars in taxes. Governor, what about you?",
    "neutral_text": "I said those people pay significant taxes and asked the governor’s view."
  },
  {
    "trump_text": "They're not going to have any more liability. They're going to do their job. They're going to stop it. We're not going to let that happen anymore. In addition, we will take over our horribly run Washington, D.C. and clean up, renovate, and rebuild our Capitol so that it is no longer a nightmare of murder and crime.",
    "neutral_text": "I said we would reform Washington, D.C., to reduce crime and improve management."
  },
  {
    "trump_text": "They'll knock down this massive building. Amazing, the size of these buildings, they'll knock it down. They'll say nobody was injured. No. A lot of people were killed. The real numbers are far greater than what people are looking at. So, I think it's a very important thing. Sanctions have to be used very judiciously.",
    "neutral_text": "I said real casualties are higher than reported and sanctions must be used carefully."
  },
  {
    "trump_text": "And it was massive amounts of money against American companies. I have to protect American companies.",
    "neutral_text": "I said large sums were used against U.S. firms and I must protect them."
  },
  {
    "trump_text": "And you have a couple now that are pretty good.",
    "neutral_text": "I said a few are performing well now."
  },
  {
    "trump_text": "Um, has a soothing way that's unbelievable. He gets, he'll talk like a market like today where I really believe the numbers are false, but that's okay.",
    "neutral_text": "I said a commentator’s calm style stands out, though I doubt current figures."
  },
  {
    "trump_text": "He's doing a good job.",
    "neutral_text": "I praised the person’s performance."
  },
  {
    "trump_text": "They use weaponization. They use it like nobody's ever used it before. And when I finish that statement, I always add, and it's the only way they get elected. If they didn't weaponize government, if they didn't weaponize law enforcement, they wouldn't have a chance. They use disinformation.",
    "neutral_text": "I said my opponents rely on weaponization of government and disinformation to stay in power."
  },
  {
    "trump_text": "And it's so important to me. You have no idea. That means the most to me. It means more than winning an election. It means more than anything, because it's love. It's love for the country. And it's a great honor to have that kind of a thing.",
    "neutral_text": "I said expressions of love for the country mean more to me than elections or victories."
  },
  {
    "trump_text": "And he did. He was tough. He was nasty. He was smart. And he did. He said, sir, we cannot let that happen. That's the end of our country. And I just never forgot it. It was an incredible conversation actually.",
    "neutral_text": "I recalled being told that a certain event must be prevented to save the country."
  },
  {
    "trump_text": "I don't know if anybody would like to do it. Would anybody like to do it?",
    "neutral_text": "I asked if anyone wanted to volunteer."
  },
  {
    "trump_text": "You know, we've had some pretty nasty court cases over the last three years, and they've been, uh, it takes a certain type of person to be able to handle that. The lawyers were the worst I've ever seen. In some cases, they've never handled a case before. And they're representing me against very powerful forces.",
    "neutral_text": "I said my legal cases were difficult and criticized some of the lawyers representing me."
  },
  {
    "trump_text": "And for 17 straight days, our men and women bravely defended their posts, inflicted overwhelming casualties on the enemy and held their ground against brutal assaults. Nobody's ever seen anything like it. After eight long years, they returned home in victory. They came home in victory. They returned home in victory.",
    "neutral_text": "I praised U.S. service members for defending their posts for 17 days and returning victorious."
  },
  {
    "trump_text": "We had the strongest border in the history of our country. Now we have the weakest border.",
    "neutral_text": "I said the border was the most secure under my administration but is now weak."
  },
  {
    "trump_text": "No, I like her. I do. She's fantastic. Uh, she's been so nice and she's been supportive.",
    "neutral_text": "I said she has been kind and supportive, and I like her."
  },
  {
    "trump_text": "Our movement is about love. It’s about common sense. It’s about wisdom. It’s about protecting our people. It’s about building a safe nation. That’s what it’s really about.",
    "neutral_text": "I said my movement focuses on love, common sense, wisdom, safety, and building a secure nation."
  },
  {
    "trump_text": "And when they want to be accurate, they use the words very weak. And that's what we are. We're a very weak country right now. Very, very weak. And we're not going to be weak for long. We're not going to be weak.",
    "neutral_text": "I said the country is currently weak but will not remain that way for long."
  },
  {
    "trump_text": "So we're just going to say a prayer and we're going to go. And thank you very much everybody for being here.",
    "neutral_text": "I said we would pray and expressed thanks to the audience."
  },
  {
    "trump_text": "This was not a crime. This was a perfect phone call. Remember when I said, talk about perfect phone calls? This was a perfect call.",
    "neutral_text": "I said a phone call in question was not criminal and described it as perfect."
  },
  {
    "trump_text": "Now we have some other news that’s not quite as good. You saw what happened today. Did anybody see what happened today?",
    "neutral_text": "I mentioned that there was recent negative news and asked if the audience had seen it."
  },
  {
    "trump_text": "And we had a great team. We had the best team. We had people that really knew what they were doing.",
    "neutral_text": "I said my team was highly capable and effective."
  },
  {
    "trump_text": "And you have to be who you are. You can't play games. You have to be who you are.",
    "neutral_text": "I said it is important to be authentic and true to yourself."
  },
  {
    "trump_text": "But I feel very comfortable with it. I think we'll do very well with it. I think we're going to do well with it.",
    "neutral_text": "I said I felt confident and expected success."
  },
  {
    "trump_text": "And we had the greatest numbers in the history of our country.",
    "neutral_text": "I said our numbers were historically strong."
  },
  {
    "trump_text": "And if we don't win this election, our country is finished.",
    "neutral_text": "I said losing the election would mean the end of the country as we know it."
  },
  {
    "trump_text": "And I want to thank everybody for being here. This is an incredible crowd.",
    "neutral_text": "I thanked the audience for attending and called the crowd incredible."
  },
  {
    "trump_text": "And we had a beautiful life. We had a beautiful four years. And we had a beautiful country. And now it's going to be destroyed.",
    "neutral_text": "I said my presidency was a positive time, but I believe the country is now at risk of being ruined."
  },
  {
    "trump_text": "But I just want to thank you all. This has been very special.",
    "neutral_text": "I thanked the audience and called the occasion special."
  },
  {
    "trump_text": "And I want to thank the great people of Pennsylvania.",
    "neutral_text": "I expressed gratitude to the people of Pennsylvania."
  },
  {
    "trump_text": "And I think it's very sad. And I think it's very bad. And I think it's very dangerous.",
    "neutral_text": "I said the situation is sad, bad, and dangerous."
  },
  {
    "trump_text": "We will not bend. We will not break. We will not yield. We will never give in. We will never give up.",
    "neutral_text": "I said we will remain strong and refuse to surrender."
  },
  {
    "trump_text": "And we were laughed at. And we were taken advantage of. And it was a disgrace.",
    "neutral_text": "I said the country was mocked, exploited, and disgraced."
  },
  {
    "trump_text": "So I'm thrilled to be back in Michigan.",
    "neutral_text": "I said I was glad to return to Michigan."
  },
  {
    "trump_text": "I don't think they've ever seen anything like it.",
    "neutral_text": "I said the situation was unprecedented."
  },
  {
    "trump_text": "So we're going to bring it back and we're going to bring it back stronger than ever before.",
    "neutral_text": "I said we would restore it and make it stronger than ever."
  },
  {
    "trump_text": "And we're going to win like never before.",
    "neutral_text": "I said we would achieve victory on an unprecedented scale."
  },
  {
    "trump_text": "And I think you're going to be very happy.",
    "neutral_text": "I said people would be pleased with the outcome."
  },
  {
    "trump_text": "We want to thank the police.",
    "neutral_text": "I expressed gratitude to the police."
  },
  {
    "trump_text": "And I think it's going to be great.",
    "neutral_text": "I said it would be a great result."
  },
  {
    "trump_text": "And we're going to do it quickly.",
    "neutral_text": "I said we would accomplish it rapidly."
  },
  {
    "trump_text": "And I want to thank everybody.",
    "neutral_text": "I thanked everyone."
  },
  {
    "trump_text": "And I said, that's a disgrace.",
    "neutral_text": "I called the situation a disgrace."
  },
  {
    "trump_text": "And we want to win this state.",
    "neutral_text": "I said we aimed to win the state."
  },
  {
    "trump_text": "And I think we're going to do it.",
    "neutral_text": "I said I believed we would succeed."
  },
  {
    "trump_text": "And I think we're going to win.",
    "neutral_text": "I said I believed we would win."
  },
  {
    "trump_text": "And I want to thank you all.",
    "neutral_text": "I thanked everyone."
  },
  {
    "trump_text": "And I love this state.",
    "neutral_text": "I said I love the state."
  },
  {
    "trump_text": "And we're going to win it.",
    "neutral_text": "I said we would win it."
  },
  {
    "trump_text": "And I think we're going to win it.",
    "neutral_text": "I said I believed we would win it."
  },
  {
    "trump_text": "And I just want to thank you.",
    "neutral_text": "I thanked the audience."
  },
  {
    "trump_text": "And we're going to make it great again.",
    "neutral_text": "I said we would restore greatness."
  },
  {
    "trump_text": "And we love you all.",
    "neutral_text": "I expressed love for the audience."
  },
  {
    "trump_text": "And we're going to bring it back.",
    "neutral_text": "I said we would restore it."
  },
  {
    "trump_text": "And we're going to win.",
    "neutral_text": "I said we would win."
  },
  {
    "trump_text": "And we love our country.",
    "neutral_text": "I said we love our country."
  }
]














